
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Kubernetes and Helm 介绍 · 云原生运维指南</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="魏文弟">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-base16-ateliersulphurpool.light.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-auto-scroll-table/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-flexible-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="bushu.html" />
    
    
    <link rel="prev" href="../cloudnative/jieshao.html" />
    

    
        <link rel="shortcut icon" href='../https:/gitee.com/sretech/images/raw/master/favicon/favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='../https:/gitee.com/sretech/images/raw/master/favicon/favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"user":"weiwendi","repo":"cloudnative-handbook","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.aiops.red" target="_blank" class="custom-link">博客</a>
        </li>
    
        
        <li>
            <a href="https://gitee.com/sretech/images/raw/master/wechatpublic.jpg" target="_blank" class="custom-link">公众号: sretech</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        <li class="header">云原生运维指南</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                        <b>1.1.</b>
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../cloudnative/jieshao.html">
            
                <a href="../cloudnative/jieshao.html">
            
                    
                        <b>1.2.</b>
                    
                    课程介绍
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Helm 最佳实践</li>
        
        
    
        <li class="chapter active" data-level="2.1" data-path="jieshao.html">
            
                <a href="jieshao.html">
            
                    
                        <b>2.1.</b>
                    
                    Kubernetes and Helm 介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="bushu.html">
            
                <a href="bushu.html">
            
                    
                        <b>2.2.</b>
                    
                    Helm 部署
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="anzhuangcharts.html">
            
                <a href="anzhuangcharts.html">
            
                    
                        <b>2.3.</b>
                    
                    安装 Helm 图表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="chartsjinjie.html">
            
                <a href="chartsjinjie.html">
            
                    
                        <b>2.4.</b>
                    
                    Helm 图表进阶
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="kaifacharts.html">
            
                <a href="kaifacharts.html">
            
                    
                        <b>2.5.</b>
                    
                    开发 Helm 图表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.6" data-path="ceshicharts.html">
            
                <a href="ceshicharts.html">
            
                    
                        <b>2.6.</b>
                    
                    测试 Helm 图表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.7" data-path="helmcicd.html">
            
                <a href="helmcicd.html">
            
                    
                        <b>2.7.</b>
                    
                    使用 CI/CD 和 GitOps 实现 Helm 自动化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.8" data-path="operator.html">
            
                <a href="operator.html">
            
                    
                        <b>2.8.</b>
                    
                    Helm 与 Operator
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.9" data-path="plugins.html">
            
                <a href="plugins.html">
            
                    
                        <b>2.9.</b>
                    
                    Helm 插件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.10" data-path="security.html">
            
                <a href="security.html">
            
                    
                        <b>2.10.</b>
                    
                    Helm 安全
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Kubernetes and Helm 介绍</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="kubernetes-&#x4E0E;-helm-&#x4ECB;&#x7ECD;">Kubernetes &#x4E0E; Helm &#x4ECB;&#x7ECD;</h1>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BF9;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3001;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x4EE5;&#x53CA;&#x80FD;&#x591F;&#x627F;&#x53D7;&#x5404;&#x79CD;&#x7A0B;&#x5EA6;&#x8D1F;&#x8F7D;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x662F;&#x538B;&#x5728;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x5934;&#x4E0A;&#x7684;&#x4E09;&#x5EA7;&#x5927;&#x5C71;&#x3002;&#x5728;&#x5BB9;&#x5668;&#x5316;&#x6D41;&#x884C;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x63A5;&#x89E6;&#x66F4;&#x591A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F; <strong>monolithic</strong>(&#x5355;&#x4F53;)&#x67B6;&#x6784;&#x3002;Docker &#x7684;&#x8BDE;&#x751F;&#xFF0C;&#x63A8;&#x52A8;&#x4E86;&#x5BB9;&#x5668;&#x5316;&#x7684;&#x53D1;&#x5C55;&#xFF0C;<strong>monolithic</strong> &#x67B6;&#x6784;&#x4E5F;&#x9010;&#x6E10;&#x8F6C;&#x5411;&#x4E86;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#xFF0C;&#x5E76;&#x4EE5;&#x5BB9;&#x5668;&#x5316;&#x65B9;&#x5F0F;&#x90E8;&#x7F72;&#xFF0C;&#x76F4;&#x5230;&#x6F14;&#x53D8;&#x4E3A;&#x4F7F;&#x7528; Kubernetes &#x4E4B;&#x7C7B;&#x7684;&#x5DE5;&#x5177;&#x7F16;&#x6392;&#x548C;&#x6269;&#x5C55;&#x5BB9;&#x5668;&#x5316;&#x5FAE;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x867D;&#x7136; Kubernetes &#x662F;&#x9AD8;&#x6548;&#x7684;&#x5BB9;&#x5668;&#x7F16;&#x6392;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x5B83;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x9661;&#x5CED;&#xFF0C;&#x5BF9;&#x4E8E;&#x4F7F;&#x7528; Kubernetes &#x7684;&#x56E2;&#x961F;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x5C0F;&#x7684;&#x6311;&#x6218;&#x3002;Helm &#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5316;&#x5728; Kubernetes &#x4E0A;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x7528;&#x6237;&#x901A;&#x8FC7; Helm &#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x3001;&#x65B9;&#x4FBF;&#x5730;&#x5728; Kubernetes &#x96C6;&#x7FA4;&#x4E2D;&#x90E8;&#x7F72;&#x548C;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;Helm &#x62BD;&#x8C61;&#x4E86;&#x914D;&#x7F6E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x63D0;&#x9AD8;&#x56E2;&#x961F;&#x5728; Kubernetes &#x5E73;&#x53F0;&#x4E0A;&#x7684;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x4F1A;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD; Helm &#x7684;&#x5404;&#x79CD;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x63A2;&#x7D22; Helm &#x5982;&#x4F55;&#x4F7F; Kubernetes &#x4E0A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x3002;&#x4E00;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x4EEC;&#x4EC5;&#x4F5C;&#x4E3A;&#x4F7F;&#x7528;&#x8005;&#xFF0C;&#x4F7F;&#x7528;&#x793E;&#x533A;&#x7F16;&#x5199;&#x597D;&#x7684; Helm Charts &#x5B9E;&#x8DF5;&#x7A0B;&#x5E8F;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x3002;&#x968F;&#x7740;&#x5185;&#x5BB9;&#x6DF1;&#x5165;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x4F5C;&#x4E3A; Helm Charts &#x5F00;&#x53D1;&#x8005;&#x89D2;&#x8272;&#xFF0C;&#x5E76;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x9AD8;&#x6548;&#x7684;&#x6253;&#x51FA;&#x6613;&#x7528;&#x7684; Kubernetes &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5305;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4ECB;&#x7ECD; Helm &#x63D2;&#x4EF6;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7BA1;&#x7406;&#x53CA;&#x5B89;&#x5168;&#x6027;&#x8FD9;&#x4E9B;&#x9AD8;&#x7EA7;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x4ECE;&#x4E86;&#x89E3;&#x5FAE;&#x670D;&#x52A1;&#x3001;&#x5BB9;&#x5668;&#x3001;Kubernetes&#xFF0C;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E26;&#x6765;&#x7684;&#x6311;&#x6218;&#x5F00;&#x59CB;&#x3002;&#x968F;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA; Helm &#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x548C;&#x4F18;&#x70B9;&#x3002;</p>
<h2 id="&#x4ECE;-monolithic-&#x5230;&#x5FAE;&#x670D;&#x52A1;">&#x4ECE; monolithic &#x5230;&#x5FAE;&#x670D;&#x52A1;</h2>
<p>&#x4F60;&#x5E94;&#x8BE5;&#x542C;&#x8BF4;&#x8FC7;&#x6469;&#x5C14;&#x5B9A;&#x5F8B;&#xFF0C;&#x5B83;&#x7531;&#x82F1;&#x7279;&#x5C14;&#x521B;&#x59CB;&#x4EBA;&#x4E4B;&#x4E00;&#x7684;&#x6208;&#x767B;&#x6469;&#x5C14;&#x63D0;&#x51FA;&#xFF0C;&#x5185;&#x5982;&#x662F;&#xFF1A;&#x201C;&#x5F53;&#x4EF7;&#x683C;&#x4E0D;&#x53D8;&#x65F6;&#xFF0C;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x4E0A;&#x53EF;&#x5BB9;&#x7EB3;&#x7684;&#x5143;&#x5668;&#x4EF6;&#x6570;&#x76EE;&#xFF0C;&#x7EA6;&#x6BCF;&#x9694;18-24&#x4E2A;&#x6708;&#x4FBF;&#x4F1A;&#x589E;&#x52A0;&#x4E00;&#x500D;&#xFF0C;&#x6027;&#x80FD;&#x4E5F;&#x5C06;&#x63D0;&#x5347;&#x4E00;&#x500D;&#x201D;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x79CD;&#x8D8B;&#x52BF;&#x8FD1;&#x51E0;&#x5E74;&#x7A0D;&#x663E;&#x5E73;&#x606F;&#xFF0C;&#x4F46;&#x5728;&#x5904;&#x7406;&#x5668;&#x5B58;&#x5728;&#x7684;&#x5934; 30 &#x5E74;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x8D8B;&#x52BF;&#x7684;&#x6301;&#x4E45;&#x6027;&#x5BF9;&#x6280;&#x672F;&#x7684;&#x8FDB;&#x6B65;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x7F16;&#x7A0B;&#x4EBA;&#x5458;&#x5145;&#x5206;&#x5229;&#x7528;&#x4E86;&#x8FD9;&#x4E00;&#x7279;&#x6027;&#xFF0C;&#x5728;&#x5F00;&#x53D1;&#x8F6F;&#x4EF6;&#x65F6;&#x96C6;&#x6210;&#x4E86;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x529F;&#x80FD;&#x548C;&#x7EC4;&#x4EF6;&#x3002;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#xFF0C;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x7531;&#x591A;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x7EC4;&#x4EF6;&#x7EC4;&#x6210;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EC4;&#x4EF6;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x5F00;&#x53D1;&#x4E3A;&#x72EC;&#x7ACB;&#x7684;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x5C31;&#x662F; <strong>monolithic</strong> &#x67B6;&#x6784;&#xFF0C;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x7684;&#x4F18;&#x52BF;&#x4E4B;&#x4E00;&#xFF0C;&#x5C31;&#x662F;&#x7B80;&#x5316;&#x4E86;&#x90E8;&#x7F72;&#x8FC7;&#x7A0B;&#x3002;&#x4F46;&#x968F;&#x7740;&#x884C;&#x4E1A;&#x8D8B;&#x52BF;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x4F01;&#x4E1A;&#x66F4;&#x52A0;&#x5173;&#x6CE8;&#x5FEB;&#x901F;&#x4EA4;&#x4ED8;&#x7684;&#x80FD;&#x529B;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;<strong>monolithic</strong> &#x67B6;&#x6784;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9762;&#x4E34;&#x4E86;&#x8BB8;&#x591A;&#x6311;&#x6218;&#xFF1A;&#x6BCF;&#x5F53;&#x5BF9;&#x8F6F;&#x4EF6;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x65F6;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x9A8C;&#x8BC1;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53CA;&#x5176;&#x6240;&#x6709;&#x57FA;&#x7840;&#x7EC4;&#x4EF6;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x4FEE;&#x6539;&#x540E;&#x6CA1;&#x6709;&#x5F02;&#x5E38;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x5B8C;&#x6210;&#xFF0C;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x4E86;&#x8F6F;&#x4EF6;&#x4EA4;&#x4ED8;&#x7684;&#x901F;&#x5EA6;&#x53CA;&#x673A;&#x52A8;&#x6027;&#x3002;</p>
<p>&#x4F01;&#x4E1A;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x66F4;&#x5FEB;&#x5B8C;&#x6210;&#x8F6F;&#x4EF6;&#x4EA4;&#x4ED8;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x8DE8;&#x7EC4;&#x7EC7;&#x6216;&#x90E8;&#x95E8;&#x7684;&#x5FEB;&#x901F;&#x4EA4;&#x4ED8;&#x80FD;&#x529B;&#xFF0C;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5F88;&#x591A;&#x4F01;&#x4E1A;&#x5F15;&#x5165;&#x4E86; DevOps &#x6587;&#x5316;&#x3002;DevOps &#x63D0;&#x5021;&#x4EE5;&#x6700;&#x5C0F;&#x7684;&#x4EE3;&#x4EF7;&#x5E2E;&#x52A9;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x8FDB;&#x5165;&#x9AD8;&#x6548;&#x7684;&#x534F;&#x4F5C;&#x6A21;&#x5F0F;&#x548C;&#x5FEB;&#x901F;&#x4EA4;&#x4ED8;&#x7684;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x3002;&#x4E3A;&#x4E86;&#x5728;&#x8FD9;&#x79CD;&#x65B0;&#x6A21;&#x5F0F;&#x4E2D;&#x4FDD;&#x6301;&#x53EF;&#x6301;&#x7EED;&#x6027;&#xFF0C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x4E5F;&#x4ECE;&#x5927;&#x578B; <strong>monolithic</strong> &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9010;&#x6E10;&#x62C6;&#x5206;&#x4E3A;&#x53EF;&#x4EE5;&#x66F4;&#x5FEB;&#x901F;&#x4EA4;&#x4ED8;&#x7684;&#x591A;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x4E9B;&#x72EC;&#x7ACB;&#x7684;&#x591A;&#x4E2A;&#x5C0F;&#x5E94;&#x7528;&#x88AB;&#x547D;&#x540D;&#x4E3A;&#x5FAE;&#x670D;&#x52A1;&#x3002;&#x5FAE;&#x670D;&#x52A1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x56FA;&#x6709;&#x7684;&#x7279;&#x6027;&#x5E26;&#x6765;&#x4E86;&#x4E00;&#x4E9B;&#x7406;&#x60F3;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5305;&#x62EC;&#x5E76;&#x884C;&#x5F00;&#x53D1;&#x3001;&#x72EC;&#x7ACB;&#x6269;&#x5C55;&#xFF08;&#x589E;&#x52A0;&#x5B9E;&#x4F8B;&#x6570;&#x91CF;&#xFF09;&#x670D;&#x52A1;&#x7B49;&#x3002;</p>
<p>&#x4ECE; <strong>monolithic</strong> &#x670D;&#x52A1;&#x5230;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x67B6;&#x6784;&#x53D8;&#x5316;&#xFF0C;&#x4E5F;&#x6539;&#x53D8;&#x4E86;&#x8F6F;&#x4EF6;&#x4EA4;&#x4ED8;&#x65F6;&#x7684;&#x6253;&#x5305;&#x548C;&#x90E8;&#x7F72;&#x65B9;&#x5F0F;&#x3002;<strong>monolithic</strong> &#x670D;&#x52A1;&#x90E8;&#x7F72;&#x65F6;&#xFF0C;&#x6574;&#x53F0;&#x673A;&#x5668;&#x4E13;&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x65F6;&#x4EE3;&#xFF0C;&#x5355;&#x4E2A;&#x5E94;&#x7528;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#x6574;&#x4F53;&#x51CF;&#x5C11;&#xFF0C;&#x56E0;&#x6B64;&#x5C06;&#x6574;&#x53F0;&#x673A;&#x5668;&#x4E13;&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#x5DF2;&#x4E0D;&#x518D;&#x53EF;&#x884C;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x5BB9;&#x5668;&#x6280;&#x672F;&#x5B8C;&#x7F8E;&#x8D34;&#x5408;&#x4E86;&#x521B;&#x5EFA;&#x5FAE;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x65F6;&#x6240;&#x9700;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5BB9;&#x5668;&#x6280;&#x672F;&#x867D;&#x7136;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x65B9;&#x9762;&#x6709;&#x7740;&#x60A0;&#x4E45;&#x5386;&#x53F2;&#xFF0C;&#x4F46;&#x771F;&#x6B63;&#x201C;&#x98DE;&#x5165;&#x5BFB;&#x5E38;&#x767E;&#x59D3;&#x5BB6;&#x201D;&#xFF0C;&#x8FD8;&#x8981;&#x4ECE; Docker &#x7684;&#x8BDE;&#x751F;&#x5F00;&#x59CB;&#xFF0C;&#x5B83;&#x7B80;&#x5355;&#x4FBF;&#x6377;&#x7684;&#x6253;&#x5305;&#x65B9;&#x5F0F;&#x3001;&#x6613;&#x4E8E;&#x5206;&#x53D1;&#x5BB9;&#x5668;&#x955C;&#x50CF;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5C06;&#x5BB9;&#x5668;&#x5316;&#x63A8;&#x5411;&#x4E86;&#x5927;&#x4F17;&#x3002;</p>
<p>&#x5BB9;&#x5668;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x5DF2;&#x6210;&#x4E86;&#x5929;&#x4F5C;&#x4E4B;&#x5408;&#x3002;&#x7ED3;&#x5408;&#x5BB9;&#x5668;&#x6280;&#x672F;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6709;&#x4E86;&#x4FBF;&#x6377;&#x7684;&#x6253;&#x5305;&#x548C;&#x5206;&#x53D1;&#x673A;&#x5236;&#x3001;&#x5171;&#x4EAB;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x7684;&#x540C;&#x65F6;&#x53C8;&#x5F7C;&#x6B64;&#x9694;&#x79BB;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x968F;&#x7740;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5BB9;&#x5668;&#x5316;&#x5FAE;&#x670D;&#x52A1;&#x88AB;&#x90E8;&#x7F72;&#xFF0C;&#x5BF9;&#x5BB9;&#x5668;&#x7684;&#x7BA1;&#x7406;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x96BE;&#x9898;&#x3002;&#x5982;&#x4F55;&#x786E;&#x4FDD;&#x6BCF;&#x4E2A;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x5BB9;&#x5668;&#x7684;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#xFF1F;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x53D1;&#x751F;&#x4E86;&#x6545;&#x969C;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5982;&#x679C;&#x5BBF;&#x4E3B;&#x673A;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x4E0D;&#x8DB3;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;Kubernetes &#x5F88;&#x597D;&#x5730;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E9B;&#x5BB9;&#x5668;&#x7F16;&#x6392;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;-kubernetes">&#x4EC0;&#x4E48;&#x662F; Kubernetes</h2>
<p>Kubernetes &#x5E38;&#x88AB;&#x7F29;&#x5199;&#x4E3A; k8s(8 &#x4EE3;&#x8868; k s &#x4E4B;&#x95F4;&#x7684;8&#x4E2A;&#x5B57;&#x7B26;)&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;&#x7684;&#x5BB9;&#x5668;&#x7F16;&#x6392;&#x5E73;&#x53F0;&#xFF0C;&#x6E90;&#x81EA; Google &#x7684;&#x5185;&#x90E8;&#x7F16;&#x6392;&#x5DE5;&#x5177; Borg &#x7CFB;&#x7EDF;&#xFF0C;&#x4E8E; 2015 &#x5E74;&#x5F00;&#x6E90;&#x3002;&#x5728; 2015 &#x5E74; 7 &#x6708; 21 &#x65E5;&#x53D1;&#x5E03; v1.0 &#x4E4B;&#x540E;&#xFF0C;Google &#x548C; Linux Foundation &#x5408;&#x4F5C;&#x6210;&#x7ACB;&#x4E86; Cloud Native Computing Foundation(CNCF)&#xFF0C;&#x662F; Kubernete &#x9879;&#x76EE;&#x7684;&#x5F53;&#x524D;&#x7EF4;&#x62A4;&#x8005;&#x3002;</p>
<p>Kubernetes &#x662F;&#x5E0C;&#x814A;&#x8BED;&#xFF0C;&#x610F;&#x4E3A;&#x201C;&#x8235;&#x624B;&#x201D;&#x6216;&#x201C;&#x98DE;&#x884C;&#x5458;&#x201D;&#x3002;&#x8235;&#x624B;&#x8D1F;&#x8D23;&#x64CD;&#x7EB5;&#x8239;&#x8236;&#xFF0C;&#x5E76;&#x4E0E;&#x8239;&#x5458;&#x7D27;&#x5BC6;&#x5408;&#x4F5C;&#xFF0C;&#x786E;&#x4FDD;&#x822A;&#x884C;&#x5B89;&#x5168;&#x7A33;&#x5B9A;&#x4EE5;&#x53CA;&#x8239;&#x5458;&#x7684;&#x6574;&#x4F53;&#x5B89;&#x5168;&#x3002;Kubernetes &#x5728;&#x5BB9;&#x5668;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x65B9;&#x9762;&#x4E5F;&#x8D1F;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x8D23;&#x4EFB;&#x3002;Kubernetes &#x8D1F;&#x8D23;&#x5BB9;&#x5668;&#x7684;&#x7F16;&#x6392;&#x548C;&#x8C03;&#x5EA6;&#xFF0C;&#x5C06;&#x5BB9;&#x5668;&#x90E8;&#x7F72;&#x5230;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5176;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x7684;&#x9002;&#x5F53; Worker &#x8282;&#x70B9;&#x3002;Kubernetes &#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x548C;&#x5065;&#x5EB7;&#x68C0;&#x67E5;&#x6765;&#x786E;&#x4FDD;&#x8FD9;&#x4E9B;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x770B;&#x770B; Kubernetes &#x662F;&#x5982;&#x4F55;&#x7B80;&#x5316;&#x7BA1;&#x7406;&#x5BB9;&#x5668;&#x5316;&#x5FAE;&#x670D;&#x52A1;&#xFF0C;&#x4EE5;&#x53CA;&#x5E2E;&#x52A9;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x5378;&#x6389;&#x5934;&#x9876;&#x4E09;&#x5EA7;&#x5927;&#x5C71;&#x7684;&#xFF1A;</p>
<h3 id="&#x5BB9;&#x5668;&#x7F16;&#x6392;">&#x5BB9;&#x5668;&#x7F16;&#x6392;</h3>
<p>&#x5BB9;&#x5668;&#x7F16;&#x6392;&#x662F; Kubernetes &#x6700;&#x663E;&#x8457;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x6C60;&#xFF0C;&#x628A;&#x5BB9;&#x5668;&#x8C03;&#x5EA6;&#x5230;&#x6EE1;&#x8DB3;&#x5176;&#x8FD0;&#x884C;&#x7684;&#x4E3B;&#x673A;&#x4E0A;&#x3002;&#x6211;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x793A;&#x4F8B;&#x6765;&#x8BF4;&#x660E;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x4E0B;&#x56FE;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8BF7;&#x6C42; 2Gi &#x5185;&#x5B58;&#x548C; 1 &#x6838; CPU&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5BB9;&#x5668;&#x88AB;&#x8C03;&#x5EA6;&#x5230;&#x7684; Worker &#x8282;&#x70B9;&#x81F3;&#x5C11;&#x62E5;&#x6709;&#x6EE1;&#x8DB3;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8BF7;&#x6C42;&#x7684;&#x7A7A;&#x95F2;&#x8D44;&#x6E90;&#x3002;Kubernetes &#x8D1F;&#x8D23;&#x8DDF;&#x8E2A;&#x54EA;&#x4E9B;&#x8282;&#x70B9;&#x62E5;&#x6709;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5E76;&#x5C06;&#x5BB9;&#x5668;&#x8C03;&#x5EA6;&#x5230;&#x8BE5;&#x8282;&#x70B9;&#x3002;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x8D44;&#x6E90;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x662F;&#x4E0D;&#x4F1A;&#x88AB;&#x8C03;&#x5EA6;&#x7684;&#xFF1B;&#x5982;&#x679C;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8282;&#x70B9;&#x90FD;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#xFF0C;&#x8BE5;&#x5BB9;&#x5668;&#x4E0D;&#x4F1A;&#x88AB;&#x90E8;&#x7F72;&#xFF0C;&#x76F4;&#x5230;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x5177;&#x5907;&#x8DB3;&#x591F;&#x7684;&#x8D44;&#x6E90;&#xFF1A;</p>
<p><img src="https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/1.1diaodu.jpg" style="zoom:80%;"></p>
<p>&#x56FE;1.1-Kubernetes &#x7F16;&#x6392;&#x548C;&#x8C03;&#x5EA6;</p>
<p>&#x5BB9;&#x5668;&#x7F16;&#x6392;&#x4F7F;&#x6211;&#x4EEC;&#x65E0;&#x9700;&#x65F6;&#x65F6;&#x5173;&#x6CE8;&#x4E3B;&#x673A;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#xFF0C;Kubernetes &#x63D0;&#x4F9B;&#x4E86;&#x5BF9;&#x8FD9;&#x4E9B;&#x6307;&#x6807;&#x7684;&#x76D1;&#x63A7;&#x529F;&#x80FD;&#x3002;&#x56E0;&#x6B64;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EA;&#x9700;&#x58F0;&#x660E;&#x5BB9;&#x5668;&#x671F;&#x671B;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x62C5;&#x5FC3;&#x8D44;&#x6E90;&#x662F;&#x5426;&#x53EF;&#x7528;&#xFF0C;Kubernetes &#x4F1A;&#x5904;&#x7406;&#x597D;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x3002;</p>
<h3 id="&#x9AD8;&#x53EF;&#x7528;">&#x9AD8;&#x53EF;&#x7528;</h3>
<p>Kubernetes &#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x663E;&#x8457;&#x7279;&#x6027;&#x662F;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x4E86;&#x5197;&#x4F59;&#x548C;&#x9AD8;&#x53EF;&#x7528;&#x3002;&#x9AD8;&#x53EF;&#x7528;&#x662F;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x505C;&#x6B62;&#x670D;&#x52A1;&#xFF0C;&#x7531;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#x95F4;&#x5206;&#x914D;&#x6D41;&#x91CF;&#x3002;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#x524D;&#x63D0;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x5B95;&#x673A;&#x4E86;&#xFF0C;&#x5176;&#x4ED6;&#x5B9E;&#x4F8B;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#xFF0C;&#x8FD9;&#x5C31;&#x907F;&#x514D;&#x4E86;&#x505C;&#x670D;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x8BBA;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#x5B95;&#x673A;&#xFF0C;&#x5BF9;&#x5BA2;&#x6237;&#x7AEF;&#x6765;&#x8BF4;&#x5B8C;&#x5168;&#x65E0;&#x611F;&#x77E5;&#x3002;Kubernetes &#x63D0;&#x4F9B;&#x4E86; Service &#x8FD9;&#x79CD;&#x7F51;&#x7EDC;&#x673A;&#x5236;&#xFF0C;&#x5B9E;&#x73B0;&#x5728;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#x95F4;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3002;&#x5728; 1.3 &#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4F1A;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD; Service&#x3002;</p>
<h3 id="&#x53EF;&#x6269;&#x5C55;">&#x53EF;&#x6269;&#x5C55;</h3>
<p>&#x8003;&#x8651;&#x5230;&#x5BB9;&#x5668;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x7279;&#x6027;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Kubernetes &#x5FEB;&#x901F;&#x4F38;&#x7F29;&#x5E94;&#x7528;&#x7684;&#x8D1F;&#x8F7D;&#x80FD;&#x529B;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x6C34;&#x5E73;&#x8FD8;&#x662F;&#x5782;&#x76F4;&#x3002;</p>
<p>&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x662F;&#x90E8;&#x7F72;&#x66F4;&#x591A;&#x7684;&#x5BB9;&#x5668;&#x5B9E;&#x4F8B;&#x526F;&#x672C;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BC4;&#x4F30;&#x5230;&#x8FD0;&#x884C;&#x5728; Kubernetes &#x4E0A;&#x7684;&#x67D0;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6700;&#x8FD1;&#x8D1F;&#x8F7D;&#x4F1A;&#x589E;&#x5927;&#xFF0C;&#x53EF;&#x4EE5;&#x90E8;&#x7F72;&#x66F4;&#x591A;&#x7684;&#x526F;&#x672C;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x65E0;&#x9700;&#x5173;&#x6CE8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F1A;&#x88AB;&#x90E8;&#x7F72;&#x5230;&#x54EA;&#x4E9B;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;Kubernetes &#x662F;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x7F16;&#x6392;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x4F1A;&#x6839;&#x636E;&#x8D44;&#x6E90;&#x9700;&#x6C42;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x5C06;&#x65B0;&#x90E8;&#x7F72;&#x7684;&#x5B9E;&#x4F8B;&#x52A0;&#x5165;&#x5230;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x6C60;&#x4E2D;&#xFF0C;&#x4FDD;&#x6301;&#x5176;&#x9AD8;&#x53EF;&#x7528;&#x3002;</p>
<p>&#x5782;&#x76F4;&#x6269;&#x5C55;&#x662F;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5206;&#x914D;&#x66F4;&#x5927;&#x7684;&#x5185;&#x5B58;&#x548C; CPU &#x8D44;&#x6E90;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x4FEE;&#x6539;&#x5176;&#x8D44;&#x6E90;&#x9700;&#x6C42;&#x3002;Kubernetes &#x4F1A;&#x91CD;&#x65B0;&#x90E8;&#x7F72;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x5E76;&#x628A;&#x5B83;&#x4EEC;&#x8C03;&#x5EA6;&#x5230;&#x6EE1;&#x8DB3;&#x65B0;&#x8D44;&#x6E90;&#x9700;&#x6C42;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x3002;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x914D;&#x7F6E;&#xFF0C;Kubernetes &#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x505C;&#x670D;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x91CD;&#x65B0;&#x90E8;&#x7F72;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;</p>
<h3 id="&#x793E;&#x533A;&#x6D3B;&#x8DC3;&#x5EA6;">&#x793E;&#x533A;&#x6D3B;&#x8DC3;&#x5EA6;</h3>
<p>Kubernetes &#x62E5;&#x6709;&#x6D3B;&#x8DC3;&#x7684;&#x5F00;&#x6E90;&#x793E;&#x533A;&#xFF0C;&#x7ECF;&#x5E38;&#x6536;&#x5230;&#x8865;&#x4E01;&#x548C;&#x65B0;&#x7279;&#x6027;&#x3002;&#x793E;&#x533A;&#x8FD8;&#x5BF9;&#x6587;&#x6863;&#x505A;&#x51FA;&#x4E86;&#x5F88;&#x591A;&#x8D21;&#x732E;&#xFF0C;&#x5305;&#x62EC;&#x5B98;&#x65B9;&#x6587;&#x6863;&#x4EE5;&#x53CA;&#x4E13;&#x4E1A;&#x6216;&#x4E1A;&#x4F59;&#x7231;&#x597D;&#x8005;&#x7684;&#x535A;&#x5BA2;&#x7F51;&#x7AD9;&#x3001;&#x516C;&#x4F17;&#x53F7;&#x3002;&#x9664;&#x4E86;&#x6587;&#x6863;&#xFF0C;&#x793E;&#x533A;&#x8FD8;&#x901A;&#x8FC7;&#x79EF;&#x6781;&#x53C2;&#x4E0E;&#x8BA1;&#x5212;&#x548C;&#x53C2;&#x52A0;&#x4E16;&#x754C;&#x5404;&#x5730;&#x7684;&#x805A;&#x4F1A;&#x548C;&#x4F1A;&#x8BAE;&#xFF0C;&#x8FDB;&#x884C;&#x6280;&#x672F;&#x5206;&#x4EAB;&#x548C;&#x521B;&#x65B0;&#x3002;</p>
<p>Kubernetes &#x5927;&#x578B;&#x793E;&#x533A;&#x8FD8;&#x6784;&#x5EFA;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x589E;&#x5F3A; Kubernetes &#x7684;&#x529F;&#x80FD;&#xFF0C;Helm &#x5C31;&#x662F;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x4EE5;&#x53CA;&#x6574;&#x672C;&#x4E66;&#x4E2D;&#x770B;&#x5230;&#x7684;&#xFF1A;Helm&#x2014;&#x2014;Kubernetes &#x793E;&#x533A;&#x6210;&#x5458;&#x6784;&#x5EFA;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x7B80;&#x5316;&#x4E86; Kubernetes &#x4E2D;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x548C;&#x751F;&#x547D;&#x5468;&#x671F;&#x7BA1;&#x7406;&#xFF0C;&#x6781;&#x5927;&#x6539;&#x5584;&#x4E86;&#x5F00;&#x53D1;&#x3001;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x7684;&#x4F53;&#x9A8C;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x4E86; Kubernetes &#x4E3A;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x5E26;&#x6765;&#x7684;&#x5E2E;&#x52A9;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5982;&#x4F55;&#x5728; Kubernetes &#x4E2D;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<h2 id="kubernetes-&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;">Kubernetes &#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;</h2>
<p>&#x4E0D;&#x8BBA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x5728; Kubernetes &#x4E0A;&#xFF0C;&#x8FD8;&#x662F;&#x90E8;&#x7F72;&#x5728;&#x975E; Kubernetes &#x73AF;&#x5883;&#xFF0C;&#x6839;&#x672C;&#x4E0A;&#x662F;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x4EE5;&#x4E0B;&#x8981;&#x7D20;&#xFF1A;</p>
<ul>
<li>&#x7F51;&#x7EDC;</li>
<li>&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x548C;&#x6587;&#x4EF6;&#x6302;&#x8F7D;</li>
<li>&#x53EF;&#x7528;&#x6027;&#x548C;&#x5197;&#x4F59;</li>
<li>&#x5E94;&#x7528;&#x914D;&#x7F6E;</li>
<li>&#x5B89;&#x5168;</li>
</ul>
<p>&#x53EF;&#x4EE5;&#x4E0E; Kubernetes API(Application Programming Interface &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7F16;&#x7A0B;&#x63A5;&#x53E3;)&#x4EA4;&#x4E92;&#xFF0C;&#x5728; Kubernetes &#x96C6;&#x7FA4;&#x4E2D;&#x914D;&#x7F6E;&#x8FD9;&#x4E9B;&#x8981;&#x7D20;&#x3002;Kubernetes API &#x662F;&#x4E00;&#x7EC4;&#x7AEF;&#x70B9;(Endpoint)&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x7AEF;&#x70B9;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x3001;&#x4FEE;&#x6539;&#x3001;&#x5220;&#x9664; Kubernetes &#x8D44;&#x6E90;&#xFF0C;&#x5F88;&#x591A; Kubernetes &#x8D44;&#x6E90;&#x7528;&#x6765;&#x914D;&#x7F6E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x90E8;&#x7F72;&#x7EC6;&#x8282;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684; API &#x7AEF;&#x70B9;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728; Kubernetes &#x4E0A;&#x90E8;&#x7F72;&#x548C;&#x914D;&#x7F6E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<h3 id="deployment">Deployment</h3>
<p>Deployment &#x5B9A;&#x4E49;&#x4E86;&#x5728; Kubernetes &#x96C6;&#x7FA4;&#x4E2D;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684;&#x57FA;&#x672C;&#x7EC6;&#x8282;&#xFF0C;&#x5982;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x955C;&#x50CF;&#x3002;&#x5BB9;&#x5668;&#x955C;&#x50CF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; docker &#x5728;&#x672C;&#x5730;&#x6784;&#x5EFA;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; kaniko &#x5728; Kubernetes &#x4E0A;&#x6784;&#x5EFA;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x6307;&#x5B9A;&#x5BB9;&#x5668;&#x955C;&#x50CF;&#x5916;&#xFF0C;Deployment &#x8FD8;&#x5B9A;&#x4E49;&#x4E86;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x526F;&#x672C;&#x6570;&#x3002;&#x521B;&#x5EFA; Deployment &#x65F6;&#xFF0C;&#x4F1A;&#x751F;&#x6210;&#x540D;&#x4E3A; ReplicaSet &#x7684;&#x4E2D;&#x95F4;&#x8D44;&#x6E90;&#x3002;ReplicaSet &#x90E8;&#x7F72;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x526F;&#x672C;&#x6570;&#x7531;<code>replicas</code>&#x5B57;&#x6BB5;&#x5B9A;&#x4E49;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x5728;&#x5BB9;&#x5668;&#x4E2D;&#xFF0C;&#x5BB9;&#x5668;&#x88AB;&#x5C01;&#x88C5;&#x5728; Pod &#x91CC;&#x3002;Pod &#x662F; Kubernetes &#x4E2D;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x5143;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x3002;</p>
<p>Deployment &#x8FD8;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8D44;&#x6E90;&#x9650;&#x5236;&#x3001;&#x8FD0;&#x884C;&#x72B6;&#x51B5;&#x68C0;&#x67E5;&#x548C;&#x5377;&#x6302;&#x8F7D;&#x3002;Deployment &#x521B;&#x5EFA;&#x540E;&#x7684;&#x67B6;&#x6784;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<figure id="fig2.1.1"><img src="https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/1.2dtcreate.jpg" alt="1.2dtcreate" style="zoom:80%;"><figcaption>1.2dtcreate</figcaption></figure>
<p>&#x56FE;1.2- Deployment &#x521B;&#x5EFA;&#x4E00;&#x7EC4; Pods</p>
<h3 id="service">Service</h3>
<p>Deployment &#x90E8;&#x7F72;&#x4E86;&#x4E00;&#x7EC4; Pods(&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;)&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x8FD9;&#x4E9B; Pods&#xFF0C;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x4E0D;&#x80FD;&#x8FDB;&#x884C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3001;&#x66F4;&#x65B0; Pods &#x540E;&#x5730;&#x5740;&#x4F1A;&#x6539;&#x53D8;&#x3002;&#x8FD9;&#x65F6;&#x5C31;&#x9700;&#x8981;&#x5F15;&#x5165;&#x53E6;&#x4E00;&#x4E2A;&#x8D44;&#x6E90; Service &#x4E86;&#x3002;Service &#x7684; IP &#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x529F;&#x80FD;&#x7C7B;&#x4F3C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;&#xFF0C;&#x628A;&#x6D41;&#x91CF;&#x5206;&#x53D1;&#x5230;&#x540E;&#x7AEF;&#x7684; Pods &#x4E0A;&#xFF0C;&#x63D0;&#x4F9B;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x548C;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x662F;&#x4E00;&#x4E2A; Service &#x7684;&#x793A;&#x4F8B;&#x7ED3;&#x6784;&#xFF0C;Service &#x4F4D;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x548C; Pod &#x4E4B;&#x95F4;&#xFF0C;&#x63D0;&#x4F9B;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x548C;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#x4F5C;&#x7528;&#xFF1A;</p>
<figure id="fig2.1.2"><img src="https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/1.3Service.jpg" alt="1.3Service" style="zoom:80%;"><figcaption>1.3Service</figcaption></figure>
<p>&#x56FE;1.3-Service &#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x5668;</p>
<h3 id="persistentvolumeclaim">PersistentVolumeClaim</h3>
<p>&#x5FAE;&#x670D;&#x52A1;&#x98CE;&#x683C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x547D;&#x5468;&#x671F;&#x6BD4;&#x8F83;&#x77ED;&#x6682;&#xFF0C;&#x4E0D;&#x5177;&#x5907;&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x3002;&#x7136;&#x800C;&#x5728;&#x5B9E;&#x9645;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x8BB8;&#x591A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EA7;&#x751F;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x662F;&#x8981;&#x5728;&#x5BB9;&#x5668;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E4B;&#x5916;&#xFF0C;&#x8981;&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x7684;&#x3002;Kubernetes &#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x5C01;&#x88C5;&#x4E86;&#x5982;&#x4F55;&#x63D0;&#x4F9B;&#x5B58;&#x50A8;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B58;&#x50A8;&#x7684;&#x5E95;&#x5C42;&#x7EC6;&#x8282;&#xFF0C;&#x4ECE;&#x800C;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <strong>PersistentVolumeClaim</strong> &#x7AEF;&#x70B9;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5206;&#x914D;&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x3002;Kubernetes &#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x8D1F;&#x8D23;&#x9759;&#x6001;&#x5206;&#x914D;&#x5B58;&#x50A8;(PersistentVolume)&#x3001;&#x6216;&#x4F7F;&#x7528; StorageClass &#x52A8;&#x6001;&#x5206;&#x914D;&#x5B58;&#x50A8;(&#x5B83;&#x5206;&#x914D;PersistentVolume&#x4EE5;&#x54CD;&#x5E94; PersistentVolumeClaim &#x7AEF;&#x70B9;)&#x3002;<strong>PersistentVolume</strong> &#x6355;&#x83B7;&#x6240;&#x6709;&#x5FC5;&#x9700;&#x7684;&#x5B58;&#x50A8;&#x7EC6;&#x8282;&#xFF0C;&#x5305;&#x62EC;&#x7C7B;&#x578B;(&#x4F8B;&#x5982;NFS&#x3001;Ceph)&#x3001;&#x5B58;&#x50A8;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x4ECE;&#x7528;&#x6237;&#x7684;&#x89D2;&#x5EA6;&#x65E0;&#x8BBA;&#x5728;&#x96C6;&#x7FA4;&#x4E2D;&#x4F7F;&#x7528;&#x54EA;&#x79CD; <strong>PersistentVolume</strong>&#xFF0C;&#x90FD;&#x4E0D;&#x9700;&#x7BA1;&#x7406;&#x5E95;&#x5C42;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x3002;&#x5229;&#x7528; Kubernetes &#x7684;&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x589E;&#x52A0; Kubernetes &#x5E73;&#x53F0;&#x4E0A;&#x53EF;&#x90E8;&#x7F72;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6570;&#x91CF;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x662F; StorageClass &#x52A8;&#x6001;&#x5206;&#x914D;&#x5B58;&#x50A8;&#x793A;&#x4F8B;&#xFF1A;</p>
<figure id="fig2.1.3"><img src="https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/1.4-storageclass.jpg" alt="1.4-storageclass" style="zoom:80%;"><figcaption>1.4-storageclass</figcaption></figure>
<p>&#x56FE;1.4-PersistentVolume created by PersistentVolumeClaim</p>
<p>&#x9664;&#x4E86;&#x4EE5;&#x4E0A;&#x8FD9;&#x4E9B;&#xFF0C;Kubernetes &#x8FD8;&#x6709;&#x5F88;&#x591A;&#x8D44;&#x6E90;&#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x5DF2;&#x6EE1;&#x8DB3;&#x6211;&#x4EEC;&#x672C;&#x4E66;&#x7684;&#x4F7F;&#x7528;&#x4E86;(&#x66F4;&#x8BE6;&#x7EC6;&#x7684; Kubernetes &#x77E5;&#x8BC6;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x6211;&#x7684;<strong>Kubernetes &#x4ECE;&#x5165;&#x95E8;&#x5230;&#x5B9E;&#x6218;</strong>&#x7CFB;&#x5217;&#x6587;&#x7AE0;)&#x3002;</p>
<p>&#x4E0B;&#x4E00;&#x8282;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x8D44;&#x6E90;&#x3002;</p>
<h2 id="&#x8D44;&#x6E90;&#x7BA1;&#x7406;">&#x8D44;&#x6E90;&#x7BA1;&#x7406;</h2>
<p>&#x5728; Kubernetes &#x96C6;&#x7FA4;&#x4E2D;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8981;&#x548C; Kubernetes API &#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x754C;&#x9762;&#xFF0C;<strong>kubectl</strong> &#x662F;&#x4E3B;&#x6D41;&#x7684; Kubernetes API &#x4EA4;&#x4E92;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B; <strong>kubectl</strong> &#x662F;&#x5982;&#x4F55;&#x7BA1;&#x7406; Kubernetes &#x8D44;&#x6E90;&#x7684;&#x3002;</p>
<h3 id="&#x547D;&#x4EE4;&#x5F0F;&#x548C;&#x58F0;&#x660E;&#x5F0F;">&#x547D;&#x4EE4;&#x5F0F;&#x548C;&#x58F0;&#x660E;&#x5F0F;</h3>
<p><strong>kubectl</strong> &#x5305;&#x542B;&#x5F88;&#x591A;&#x5B50;&#x547D;&#x4EE4;&#xFF0C;&#x4EE5;&#x547D;&#x4EE4;&#x5F0F;&#x7684;&#x65B9;&#x5F0F;&#x521B;&#x5EFA;&#x548C;&#x4FEE;&#x6539;&#x8D44;&#x6E90;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x51E0;&#x4E2A;&#x5E38;&#x7528;&#x547D;&#x4EE4;&#xFF1A;</p>
<ul>
<li>create</li>
<li>describe</li>
<li>edit</li>
<li>delete</li>
</ul>
<p>kubectl &#x547D;&#x4EE4;&#x683C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><em>kubectl <verb> <noun> <arguments></arguments></noun></verb></em></p>
<p>verb &#x662F; kubectl &#x7684;&#x5B50;&#x547D;&#x4EE4;&#xFF0C;noun &#x6307;&#x7279;&#x5B9A;&#x7684; Kubernetes &#x8D44;&#x6E90;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x521B;&#x5EFA; Deployment &#x8D44;&#x6E90;&#x7684;&#x547D;&#x4EE4;&#x793A;&#x4F8B;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">kubectl create deployment my-deployment --image<span class="token operator">=</span>busybox
</code></pre>
<p>&#x8FD9;&#x6761;&#x547D;&#x4EE4;&#x4F1A;&#x6307;&#x793A; Kubernetes API &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; &#x201C;my-deployment&#x201D; &#x7684; Deployment &#x8D44;&#x6E90;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x6765;&#x81EA; Docker Hub &#x7684; busybox &#x955C;&#x50CF;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7; kubectl &#x7684; <strong>describe</strong> &#x5B50;&#x547D;&#x4EE4;&#x67E5;&#x770B; Deployment &#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">kubectl describe deployment my-deployment
</code></pre>
<p>&#x8FD9;&#x6761;&#x547D;&#x4EE4;&#x4F1A;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x8F93;&#x51FA; Deployment &#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x6761;&#x547D;&#x4EE4;&#x67E5;&#x770B; Deployment &#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x5982;&#x679C;&#x9700;&#x8981;&#x5BF9; Deployment &#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <strong>edit</strong> &#x5B50;&#x547D;&#x4EE4;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">kubectl edit deployment my-deployment
</code></pre>
<p>&#x8FD9;&#x6761;&#x547D;&#x4EE4;&#x5C06;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x50CF;&#x4F7F;&#x7528; <strong>vim</strong> &#x4E00;&#x6837;&#x4FEE;&#x6539; Deployment&#x3002;</p>
<p>&#x9700;&#x8981;&#x5220;&#x9664;&#x67D0;&#x4E2A;&#x8D44;&#x6E90;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; <strong>delete</strong> &#x5B50;&#x547D;&#x4EE4;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">kubectl delete deployment my-deployment
</code></pre>
<p>&#x6267;&#x884C;&#x6B64;&#x547D;&#x4EE4;&#xFF0C;&#x4F1A;&#x5220;&#x9664;&#x540D;&#x4E3A; &#x201C;my-deployment&#x201D; &#x7684; Deployment &#x8D44;&#x6E90;&#x3002;</p>
<p>Kubernetes &#x8D44;&#x6E90;&#x4E00;&#x65E6;&#x521B;&#x5EFA;&#xFF0C;&#x5C06;&#x4EE5; JSON &#x6587;&#x4EF6;&#x7684;&#x683C;&#x5F0F;&#x5B58;&#x5728;&#x4E8E;&#x96C6;&#x7FA4;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x5BFC;&#x51FA;&#x4E3A; YAML &#x6587;&#x4EF6;&#xFF0C;&#x4EE5;&#x63D0;&#x9AD8;&#x53EF;&#x8BFB;&#x6027;&#x3002;YAML &#x683C;&#x5F0F;&#x7684;&#x8D44;&#x6E90;&#x793A;&#x4F8B;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre class="language-"><code class="lang-yaml"><span class="token key atrule">apiVersion</span><span class="token punctuation">:</span> apps/v1
<span class="token key atrule">kind</span><span class="token punctuation">:</span> Deployment
<span class="token key atrule">metadata</span><span class="token punctuation">:</span>
  <span class="token key atrule">name</span><span class="token punctuation">:</span> busybox
<span class="token key atrule">spec</span><span class="token punctuation">:</span>
  <span class="token key atrule">replicas</span><span class="token punctuation">:</span> <span class="token number">1</span>
  <span class="token key atrule">selector</span><span class="token punctuation">:</span>
    <span class="token key atrule">matchLabels</span><span class="token punctuation">:</span>
      <span class="token key atrule">app</span><span class="token punctuation">:</span> busybox
  <span class="token key atrule">template</span><span class="token punctuation">:</span>
    <span class="token key atrule">metadata</span><span class="token punctuation">:</span>
      <span class="token key atrule">labels</span><span class="token punctuation">:</span>
        <span class="token key atrule">app</span><span class="token punctuation">:</span> busybox
    <span class="token key atrule">spec</span><span class="token punctuation">:</span>
      <span class="token key atrule">containers</span><span class="token punctuation">:</span>
        <span class="token punctuation">-</span> <span class="token key atrule">name</span><span class="token punctuation">:</span> main
          <span class="token key atrule">image</span><span class="token punctuation">:</span> busybox
          <span class="token key atrule">args</span><span class="token punctuation">:</span>
            <span class="token punctuation">-</span> sleep
            <span class="token punctuation">-</span> infinity
</code></pre>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x7840;&#x7684; yaml &#x793A;&#x4F8B;&#xFF0C;&#x4F7F;&#x7528;&#x6765;&#x81EA; Docker Hub &#x7684; busybox &#x955C;&#x50CF;&#xFF0C;&#x5E76;&#x65E0;&#x9650;&#x671F;&#x5730;&#x8FD0;&#x884C; sleep &#x547D;&#x4EE4;&#x4EE5;&#x4FDD;&#x6301; Pod &#x8FD0;&#x884C;&#x3002;</p>
<p>kubectl &#x662F;&#x4EE5;&#x547D;&#x4EE4;&#x5F0F;&#x7684;&#x65B9;&#x5F0F;&#x521B;&#x5EFA;&#x8D44;&#x6E90;&#x7684;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x66F4;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#xFF0C;&#x4F46;&#x5728;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x66F4;&#x591A;&#x7684;&#x662F;&#x4F7F;&#x7528; yaml &#x6587;&#x4EF6;&#x3002;kubectl &#x5B50;&#x547D;&#x4EE4;&#x4E0D;&#x80FD;&#x914D;&#x7F6E;&#x6240;&#x6709;&#x7684;&#x8D44;&#x6E90;&#x9009;&#x9879;&#xFF0C;&#x4F46;&#x901A;&#x8FC7; yaml &#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#xFF0C;&#x5E76;&#x4E14;&#x4E5F;&#x66F4;&#x7075;&#x6D3B;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;yaml &#x6587;&#x4EF6;&#x662F;&#x4EE5;&#x58F0;&#x660E;&#x5F0F;&#x7684;&#x65B9;&#x5F0F;&#x521B;&#x5EFA;&#x8D44;&#x6E90;&#x7684;&#x3002;</p>
<p>&#x5728;&#x58F0;&#x660E;&#x5F0F;&#x521B;&#x5EFA;&#x8D44;&#x6E90;&#x65F6;&#xFF0C;&#x7528;&#x6237;&#x9996;&#x5148;&#x4EE5; yaml &#x683C;&#x5F0F;&#x5199;&#x51FA;&#x8981;&#x521B;&#x5EFA;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x518D;&#x4F7F;&#x7528; kubectl &#x5DE5;&#x5177;&#x5C06;&#x8D44;&#x6E90;&#x5E94;&#x7528;&#x4E8E; Kubernetes API&#x3002;&#x5728;&#x547D;&#x4EE4;&#x5F0F;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4F7F;&#x7528; kubectl &#x8BF8;&#x591A;&#x5B50;&#x547D;&#x4EE4;&#x6765;&#x7BA1;&#x7406;&#x8D44;&#x6E90;&#xFF0C;&#x800C;&#x58F0;&#x660E;&#x5F0F;&#x914D;&#x7F6E;&#x4E3B;&#x8981;&#x4F9D;&#x8D56;&#x4E8E;&#x4E00;&#x4E2A; apply &#x5B50;&#x547D;&#x4EE4;&#x3002;</p>
<p>&#x58F0;&#x660E;&#x5F0F;&#x914D;&#x7F6E;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4;&#x5B9E;&#x73B0;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">kubectl apply -f my-deployment.yaml
</code></pre>
<p>&#x4F7F;&#x7528;&#x6B64;&#x547D;&#x4EE4;&#xFF0C;Kubernetes &#x4F1A;&#x6839;&#x636E;&#x8D44;&#x6E90;&#x662F;&#x5426;&#x5B58;&#x5728;&#x6765;&#x63A8;&#x65AD;&#x8981;&#x5BF9;&#x8D44;&#x6E90;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x521B;&#x5EFA;&#x6216;&#x4FEE;&#x6539;&#xFF09;&#x3002;</p>
<p>&#x914D;&#x7F6E;&#x58F0;&#x660E;&#x5F0F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ol>
<li><p>&#x521B;&#x5EFA;&#x540D;&#x4E3A; my-deployment.yaml &#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x5C06;&#x4EE5;&#x4E0B; yaml &#x683C;&#x5F0F;&#x7684;&#x5185;&#x5BB9;&#x5199;&#x5165;&#x8BE5;&#x6587;&#x4EF6;&#xFF1A;</p>
<pre class="language-"><code class="lang-yaml"><span class="token key atrule">apiVersion</span><span class="token punctuation">:</span> apps/v1
<span class="token key atrule">kind</span><span class="token punctuation">:</span> Deployment
<span class="token key atrule">metadata</span><span class="token punctuation">:</span>
  <span class="token key atrule">name</span><span class="token punctuation">:</span> busybox
<span class="token key atrule">spec</span><span class="token punctuation">:</span>
  <span class="token key atrule">replicas</span><span class="token punctuation">:</span> <span class="token number">1</span>
  <span class="token key atrule">selector</span><span class="token punctuation">:</span>
    <span class="token key atrule">matchLabels</span><span class="token punctuation">:</span>
      <span class="token key atrule">app</span><span class="token punctuation">:</span> busybox
  <span class="token key atrule">template</span><span class="token punctuation">:</span>
    <span class="token key atrule">metadata</span><span class="token punctuation">:</span>
      <span class="token key atrule">labels</span><span class="token punctuation">:</span>
        <span class="token key atrule">app</span><span class="token punctuation">:</span> busybox
    <span class="token key atrule">spec</span><span class="token punctuation">:</span>
      <span class="token key atrule">containers</span><span class="token punctuation">:</span>
        <span class="token punctuation">-</span> <span class="token key atrule">name</span><span class="token punctuation">:</span> main
          <span class="token key atrule">image</span><span class="token punctuation">:</span> busybox
          <span class="token key atrule">args</span><span class="token punctuation">:</span>
            <span class="token punctuation">-</span> sleep
            <span class="token punctuation">-</span> infinity
</code></pre>
</li>
<li><p>&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4;&#x521B;&#x5EFA; Deployment&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">kubectl apply -f my-deployment.yaml
</code></pre>
<p>&#x6267;&#x884C;&#x6B64;&#x547D;&#x4EE4;&#x540E;&#xFF0C;Kubernetes &#x5C06;&#x6309;&#x7167; yaml &#x5185;&#x5BB9;&#x521B;&#x5EFA; Deployment&#x3002;</p>
</li>
<li><p>&#x5982;&#x679C;&#x8981;&#x4FEE;&#x6539; Deployment&#xFF0C;&#x4F8B;&#x5982;&#x5C06;&#x526F;&#x672C;&#x6570;&#x4FEE;&#x6539;&#x4E3A; 2&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4FEE;&#x6539; my-deployment.yaml &#x6587;&#x4EF6;&#x5B9E;&#x73B0;&#xFF1A;</p>
<pre class="language-"><code class="lang-yaml"><span class="token key atrule">apiVersion</span><span class="token punctuation">:</span> apps/v1
<span class="token key atrule">kind</span><span class="token punctuation">:</span> Deployment
<span class="token key atrule">metadata</span><span class="token punctuation">:</span>
 <span class="token key atrule">name</span><span class="token punctuation">:</span> busybox
<span class="token key atrule">spec</span><span class="token punctuation">:</span>
 <span class="token key atrule">replicas</span><span class="token punctuation">:</span> <span class="token number">2</span> <span class="token comment"># &#x4FEE;&#x6539;&#x6B64;&#x5904;&#x7684;&#x6570;&#x503C;</span>
 <span class="token key atrule">selector</span><span class="token punctuation">:</span>
   <span class="token key atrule">matchLabels</span><span class="token punctuation">:</span>
     <span class="token key atrule">app</span><span class="token punctuation">:</span> busybox
 <span class="token key atrule">template</span><span class="token punctuation">:</span>
   <span class="token key atrule">metadata</span><span class="token punctuation">:</span>
     <span class="token key atrule">labels</span><span class="token punctuation">:</span>
       <span class="token key atrule">app</span><span class="token punctuation">:</span> busybox
   <span class="token key atrule">spec</span><span class="token punctuation">:</span>
     <span class="token key atrule">containers</span><span class="token punctuation">:</span>
       <span class="token punctuation">-</span> <span class="token key atrule">name</span><span class="token punctuation">:</span> main
         <span class="token key atrule">image</span><span class="token punctuation">:</span> busybox
         <span class="token key atrule">args</span><span class="token punctuation">:</span>
           <span class="token punctuation">-</span> sleep
           <span class="token punctuation">-</span> infinity
</code></pre>
</li>
<li><p>&#x7136;&#x540E;&#x6267;&#x884C; kubectl apply &#x547D;&#x4EE4;&#x5E94;&#x7528;&#x4FEE;&#x6539;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">kubectl apply -f my-deployment.yaml
</code></pre>
<p>&#x6267;&#x884C;&#x6B64;&#x547D;&#x4EE4;&#xFF0C;Kubernetes &#x4F1A;&#x57FA;&#x4E8E;&#x539F;&#x6709;&#x90E8;&#x7F72;&#x58F0;&#x660E; Deployment&#xFF0C;&#x526F;&#x672C;&#x6570;&#x5C06;&#x7531; 1 &#x6269;&#x5C55;&#x4E3A; 2&#x3002;</p>
</li>
<li><p>&#x5728;&#x5220;&#x9664;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x540C;&#x6837;&#x4F7F;&#x7528; delete &#x5B50;&#x547D;&#x4EE4;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">kubectl delete -f my-deployment.yaml
</code></pre>
</li>
<li><p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7; delete -f &#x6807;&#x5FD7;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#xFF0C;&#x8BE5;&#x6587;&#x4EF6;&#x63D0;&#x4F9B;&#x4E86;&#x8981;&#x5220;&#x9664;&#x7684;&#x8D44;&#x6E90;&#x540D;&#x79F0;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5; YAML &#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x53CD;&#x590D;&#x4F7F;&#x7528;&#x3002;</p>
</li>
</ol>
<p>&#x4E86;&#x89E3;&#x4E86;Kubernetes&#x8D44;&#x6E90;&#x662F;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;&#x8D44;&#x6E90;&#x914D;&#x7F6E;&#x4E2D;&#x6D89;&#x53CA;&#x7684;&#x4E00;&#x4E9B;&#x6311;&#x6218;&#x3002;</p>
<h2 id="&#x8D44;&#x6E90;&#x914D;&#x7F6E;&#x4E2D;&#x7684;&#x6311;&#x6218;">&#x8D44;&#x6E90;&#x914D;&#x7F6E;&#x4E2D;&#x7684;&#x6311;&#x6218;</h2>
<p>&#x4E0A;&#x4E00;&#x8282;&#x4ECB;&#x7ECD;&#x4E86; Kubernetes &#x8D44;&#x6E90;&#x7684;&#x4E24;&#x79CD;&#x914D;&#x7F6E;&#x65B9;&#x5F0F;(&#x547D;&#x4EE4;&#x5F0F;&#x548C;&#x58F0;&#x660E;&#x5F0F;)&#xFF0C;&#x63A5;&#x7740;&#x6211;&#x4EEC;&#x804A;&#x804A;&#x4F7F;&#x7528;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x4F1A;&#x9047;&#x5230;&#x7684;&#x6311;&#x6218;&#x3002;</p>
<h3 id="kubernetes-&#x8D44;&#x6E90;&#x7C7B;&#x578B;&#x591A;">Kubernetes &#x8D44;&#x6E90;&#x7C7B;&#x578B;&#x591A;</h3>
<p>Kubernetes&#x6709;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x8D44;&#x6E90;&#x7C7B;&#x578B;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x5DE5;&#x4F5C;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x7C7B;&#x578B;&#xFF1A;</p>
<ul>
<li>Deployment</li>
<li>StatefulSet</li>
<li>Service</li>
<li>Ingress</li>
<li>ConfigMap</li>
<li>Secret</li>
<li>StorageClass</li>
<li>PersistentVolumeClaim</li>
<li>ServiceAccount</li>
<li>Role</li>
<li>RoleBinding</li>
<li>Namespace</li>
</ul>
<p>&#x8FD9;&#x4E48;&#x591A;&#x8D44;&#x6E90;&#x7C7B;&#x578B;&#x6784;&#x6210;&#x4E86; Kubernetes &#x7684;&#x5F3A;&#x5927;&#x529F;&#x80FD;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x63D0;&#x9AD8;&#x4E86; Kubernetes &#x7684;&#x4F7F;&#x7528;&#x590D;&#x6742;&#x5EA6;&#x3002;&#x5728; Kubernetes &#x4E0A;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x786E;&#x5B9A;&#x4F7F;&#x7528;&#x54EA;&#x4E9B;&#x8D44;&#x6E90;&#xFF0C;&#x53EA;&#x6709;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x4E86;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#xFF0C;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x6B63;&#x786E;&#x7684;&#x914D;&#x7F6E;&#x3002;&#x8FD9;&#x9700;&#x8981;&#x4E30;&#x5BCC;&#x7684; Kubernetes &#x77E5;&#x8BC6;&#xFF0C;&#x5BF9;&#x4F7F;&#x7528;&#x8005;&#x6765;&#x8BF4;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x5B9A;&#x96BE;&#x5EA6;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x4EC5;&#x4EC5;&#x662F;&#x66F4;&#x591A;&#x6311;&#x6218;&#x7684;&#x5F00;&#x59CB;&#x3002;</p>
<h3 id="&#x4FDD;&#x6301;&#x8FD0;&#x884C;&#x65F6;&#x548C;&#x672C;&#x5730;&#x72B6;&#x6001;&#x4E00;&#x81F4;">&#x4FDD;&#x6301;&#x8FD0;&#x884C;&#x65F6;&#x548C;&#x672C;&#x5730;&#x72B6;&#x6001;&#x4E00;&#x81F4;</h3>
<p>&#x4E3A;&#x65B9;&#x4FBF;&#x56E2;&#x961F;&#x95F4;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x914D;&#x7F6E; Kubernetes &#x8D44;&#x6E90;&#x7684; YAML &#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x5728;&#x7C7B;&#x4F3C; GitLab &#x7684;&#x4EE3;&#x7801;&#x4ED3;&#x5E93;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x4EE3;&#x7801;&#x4ED3;&#x5E93;&#x4E2D;&#x7684; YAML &#x6587;&#x4EF6;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x8C03;&#x6574;&#x8D44;&#x6E90;&#x65F6;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6B63;&#x786E;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x4FEE;&#x6539;&#x672C;&#x5730;&#x6587;&#x4EF6;&#xFF0C;&#x5E76; <strong>apply</strong> &#x4FEE;&#x6539;&#x540E;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x672C;&#x5730;&#x72B6;&#x6001;&#x4E0E;&#x8FD0;&#x884C;&#x65F6;&#x72B6;&#x6001;&#x4E00;&#x81F4;&#x3002;&#x4F46;&#x4E5F;&#x4F1A;&#x6709;&#x4F8B;&#x5916;&#x53D1;&#x751F;&#xFF0C;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#xFF0C;&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x901A;&#x8FC7; <strong>kubectl patch</strong> &#x6216;&#x8005; <strong>kubectl edit</strong> &#x547D;&#x4EE4;&#x8DF3;&#x8FC7;&#x672C;&#x5730;&#x6587;&#x4EF6;&#xFF0C;&#x76F4;&#x63A5;&#x4FEE;&#x6539;&#x8FD0;&#x884C;&#x65F6;&#x3002;&#x8FD9;&#x5C31;&#x4F1A;&#x4F7F;&#x672C;&#x5730;&#x72B6;&#x6001;&#x548C;&#x8FD0;&#x884C;&#x65F6;&#x72B6;&#x6001;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x5BFC;&#x81F4;&#x540E;&#x671F;&#x7EF4;&#x62A4;&#x4E0E;&#x6269;&#x5C55;&#x53D8;&#x5F97;&#x66F4;&#x56F0;&#x96BE;&#x3002;</p>
<h3 id="&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x547D;&#x5468;&#x671F;&#x96BE;&#x4EE5;&#x7BA1;&#x7406;">&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x547D;&#x5468;&#x671F;&#x96BE;&#x4EE5;&#x7BA1;&#x7406;</h3>
<p>&#x59D1;&#x4E14;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5B89;&#x88C5;&#x3001;&#x5347;&#x7EA7;&#x3001;&#x56DE;&#x6EDA;&#x5B9A;&#x4E49;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x5427;&#x3002;&#x5728; Kubernetes &#x4E2D;&#x5B89;&#x88C5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F1A;&#x521B;&#x5EFA;&#x7528;&#x4E8E;&#x90E8;&#x7F72;&#x548C;&#x914D;&#x7F6E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x7B2C;&#x4E00;&#x6B21;&#x5B89;&#x88C5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5C06;&#x521B;&#x5EFA;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x6240;&#x8BF4;&#x7684;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7248;&#x672C; <strong>version1</strong>&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5347;&#x7EA7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x53EF;&#x4EE5;&#x88AB;&#x89C6;&#x4E3A;&#x662F;&#x5BF9;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x7684;&#x4E00;&#x6B21;&#x6216;&#x591A;&#x6B21;&#x7F16;&#x8F91;&#x3002;&#x6BCF;&#x4E00;&#x6B21;&#x7F16;&#x8F91;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x4E00;&#x6B21;&#x5347;&#x7EA7;&#x3002;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x4FEE;&#x6539; Service &#x8D44;&#x6E90;&#xFF0C;&#x7248;&#x672C;&#x53F7;&#x5C31;&#x4F1A;&#x53D8;&#x4E3A; <strong>version2</strong>&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x53C8;&#x4FEE;&#x6539;&#x4E86; Deployment&#x3001;ConfigMap &#x548C; Service&#xFF0C;&#x7248;&#x672C;&#x53F7;&#x5C06;&#x53D8;&#x4E3A; <strong>version3</strong>&#x3002;</p>
<p>&#x968F;&#x7740;&#x65B0;&#x7248;&#x672C;&#x6301;&#x7EED;&#x8FED;&#x4EE3;&#xFF0C;&#x8DDF;&#x8E2A;&#x7248;&#x672C;&#x53F7;&#x6108;&#x53D1;&#x56F0;&#x96BE;&#x3002;Kubernetes &#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x56FA;&#x5B9A;&#x4FDD;&#x5B58;&#x7248;&#x672C;&#x53D8;&#x5316;&#x5386;&#x53F2;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E0D;&#x5229;&#x4E8E;&#x7248;&#x672C;&#x56DE;&#x6EDA;&#x3002;&#x5047;&#x8BBE;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x4E4B;&#x524D;&#x5BF9;&#x67D0;&#x4E2A;&#x8D44;&#x6E90;&#x505A;&#x4E86;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x56E2;&#x961F;&#x5982;&#x4F55;&#x77E5;&#x9053;&#x56DE;&#x6EDA;&#x5230;&#x54EA;&#x4E2A;&#x7248;&#x672C;&#xFF1F;&#x201C;n - 1&#x201D; &#x7684;&#x60C5;&#x51B5;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x786E;&#x5B9A;&#x56DE;&#x6EDA;&#x5230;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x4F46;&#x6700;&#x8FD1;&#x7684;&#x6B63;&#x786E;&#x7248;&#x672C;&#x5982;&#x679C;&#x662F;&#x6700;&#x8FD1;&#x4E94;&#x4E2A;&#x4E4B;&#x524D;&#x7684;&#x7248;&#x672C;&#x5462;&#xFF1F;&#x56E2;&#x961F;&#x5C31;&#x53EA;&#x80FD;&#x628A;&#x751F;&#x4EA7;&#x5F53;&#x6D4B;&#x8BD5;&#xFF0C;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x5306;&#x5FD9;&#x5904;&#x7406;&#x6545;&#x969C;&#xFF0C;&#x56E0;&#x4E3A;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x54EA;&#x4E2A;&#x662F;&#x6700;&#x8FD1;&#x7684;&#x6B63;&#x786E;&#x7248;&#x672C;&#xFF0C;&#x4ECE;&#x800C;&#x901A;&#x8FC7;&#x7248;&#x672C;&#x56DE;&#x6EDA;&#x6765;&#x5FEB;&#x901F;&#x89E3;&#x51B3;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x662F;&#x9759;&#x6001;&#x7684;">&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x662F;&#x9759;&#x6001;&#x7684;</h3>
<p>&#x628A;&#x5B83;&#x4E5F;&#x5217;&#x4E3A;&#x6311;&#x6218;&#x4E4B;&#x4E00;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x5F71;&#x54CD; YAML &#x58F0;&#x660E;&#x5F0F;&#x914D;&#x7F6E;&#x7684;&#x5E94;&#x7528;&#x3002;&#x5728;&#x4F7F;&#x7528;&#x58F0;&#x660E;&#x5F0F;&#x65F6;&#xFF0C;Kubernetes &#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x672C;&#x8EAB;&#x4E0D;&#x652F;&#x6301;&#x53C2;&#x6570;&#x5316;&#x3002;&#x6709;&#x4E9B;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x53EF;&#x80FD;&#x5F88;&#x957F;&#xFF0C;&#x5305;&#x542B;&#x8BB8;&#x591A;&#x53EF;&#x5B9A;&#x5236;&#x5B57;&#x6BB5;&#xFF0C;&#x800C;&#x4E14;&#x5B8C;&#x6574;&#x5730;&#x7F16;&#x5199;&#x3001;&#x914D;&#x7F6E; YAML &#x6587;&#x4EF6;&#x975E;&#x5E38;&#x9EBB;&#x70E6;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x628A;&#x9759;&#x6001;&#x6587;&#x4EF6;&#x505A;&#x6210;&#x6A21;&#x677F;&#x3002;&#x6A21;&#x677F;&#x5C31;&#x662F;&#x6846;&#x67B6;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x4F46;&#x76F8;&#x4F3C;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#x6587;&#x672C;&#x6216;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x586B;&#x5165;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x7BA1;&#x7406;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x9700;&#x8981;&#x7EF4;&#x62A4;&#x4E0D;&#x540C;&#x7684; Deployment&#x3001;Service &#x7B49;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x91CF;&#x4F1A;&#x5F88;&#x5927;&#xFF0C;&#x5E76;&#x968F;&#x7740;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6570;&#x91CF;&#x6210;&#x500D;&#x589E;&#x52A0;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x9700;&#x8981;&#x5F15;&#x5165;&#x591A;&#x4E2A; Kubernetes &#x8D44;&#x6E90;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x6BD4;&#x8F83;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x6709;&#x5927;&#x91CF;&#x7C7B;&#x4F3C;&#x7684; YAML &#x914D;&#x7F6E;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x662F;&#x4E24;&#x4E2A;&#x8D44;&#x6E90;&#x7684; YAML &#x6587;&#x4EF6;&#x5BF9;&#x6BD4;&#x793A;&#x4F8B;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x6709;&#x5927;&#x91CF;&#x7684;&#x76F8;&#x540C;&#x914D;&#x7F6E;&#xFF0C;&#x8FD9;&#x4E9B;&#x76F8;&#x540C;&#x7684;&#x90E8;&#x5206;&#x5C31;&#x662F;&#x6A21;&#x677F;&#x3002;&#x84DD;&#x8272;&#x6587;&#x672C;&#x8868;&#x793A;&#x6A21;&#x677F;&#x884C;&#xFF0C;&#x7EA2;&#x8272;&#x6587;&#x672C;&#x8868;&#x793A;&#x53EF;&#x5B9A;&#x5236;&#x7684;&#x884C;&#xFF1A;
<img src="https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/1.5muban.jpg" alt="1.5muban" style="zoom:80%;"></p>
<p>&#x56FE;1.5 - &#x4E24;&#x4E2A;&#x6709;&#x6A21;&#x677F;&#x7684;&#x8D44;&#x6E90;&#x914D;&#x7F6E;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002;&#x5BF9;&#x4E8E;&#x7BA1;&#x7406;&#x58F0;&#x660E;&#x5F0F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x56E2;&#x961F;&#x6765;&#x8BF4;&#xFF0C;&#x6A21;&#x677F;&#x6587;&#x4EF6;&#x4F1A;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x8BA9;&#x4EBA;&#x5934;&#x75DB;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="helm-&#x811A;&#x8E0F;&#x4E03;&#x5F69;&#x7965;&#x4E91;&#x800C;&#x6765;">Helm &#x811A;&#x8E0F;&#x4E03;&#x5F69;&#x7965;&#x4E91;&#x800C;&#x6765;</h2>
<p>Kubernetes &#x793E;&#x533A;&#x4E5F;&#x610F;&#x8BC6;&#x5230;&#x4E86;&#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x3001;&#x7EF4;&#x62A4; Kubernetes &#x8D44;&#x6E90;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x4E3A;&#x4E86;&#x5E2E;&#x52A9;&#x4F7F;&#x7528;&#x8005;&#x5BA2;&#x670D;&#x8FD9;&#x4E9B;&#x6311;&#x6218;&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x3001;&#x5F3A;&#x5927;&#x3001;&#x5F00;&#x6E90;&#x3001;&#x80FD;&#x591F;&#x5728; Kubernetes &#x4E0A;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5DE5;&#x5177;&#x8BDE;&#x751F;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x5C31;&#x662F; Helm&#xFF0C;&#x7528;&#x4E8E;&#x5728; Kubernetes &#x4E0A;&#x6253;&#x5305;&#x548C;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x4E0E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x6709;&#x5F88;&#x591A;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x5B83;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A; Kubernetes &#x7684;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x3002;Helm &#x5728; Kubernetes &#x793E;&#x533A;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;&#x662F; CNCF &#x7684;&#x6BD5;&#x4E1A;&#x9879;&#x76EE;&#x3002;</p>
<p>&#x9274;&#x4E8E; Helm &#x4E0E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x7684;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x5E76;&#x4E14;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x53C8;&#x662F;&#x6211;&#x4EEC;&#x6216;&#x591A;&#x6216;&#x5C11;&#x4F7F;&#x7528;&#x8FC7;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x5927;&#x5BB6;&#x7406;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x4EE5;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x4E3A;&#x5207;&#x5165;&#x70B9;&#xFF0C;&#x4F5C;&#x4E3A;&#x5B66;&#x4E60; Helm &#x7684;&#x5F00;&#x59CB;&#x3002;</p>
<h3 id="&#x5305;&#x7BA1;&#x7406;&#x5668;">&#x5305;&#x7BA1;&#x7406;&#x5668;</h3>
<p>&#x5305;&#x7BA1;&#x7406;&#x5668;&#x7528;&#x4E8E;&#x7B80;&#x5316;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5B89;&#x88C5;&#x3001;&#x5347;&#x7EA7;&#x3001;&#x6062;&#x590D;&#x548C;&#x5220;&#x9664;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE5;&#x5305;&#x4E3A;&#x5355;&#x5143;&#x5B9A;&#x4E49;&#xFF0C;&#x5305;&#x5305;&#x542B;&#x76EE;&#x6807;&#x8F6F;&#x4EF6;&#x53CA;&#x5176;&#x4F9D;&#x8D56;&#x9879;&#x7684;&#x5143;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5305;&#x7BA1;&#x7406;&#x5668;&#x7684;&#x5DE5;&#x4F5C;&#x8FC7;&#x7A0B;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x9996;&#x5148;&#x7528;&#x6237;&#x5C06;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x540D;&#x79F0;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#xFF0C;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x5728;&#x5305;&#x5B58;&#x50A8;&#x5E93;&#x4E2D;&#x67E5;&#x627E;&#xFF0C;&#x5982;&#x679C;&#x627E;&#x5230;&#xFF0C;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x5C06;&#x5305;&#x5B9A;&#x4E49;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53CA;&#x4F9D;&#x8D56;&#x9879;&#x5B89;&#x88C5;&#x5230;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6307;&#x5B9A;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x5305;&#x7BA1;&#x7406;&#x5668;&#x8BA9;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#xFF0C;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x5728; Rocky Linux 8 &#x7CFB;&#x7EDF;&#x4E0A;&#x5B89;&#x88C5; <strong>htop</strong> &#x5305;(htop &#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x4E3B;&#x673A;&#x8D44;&#x6E90;&#x4F7F;&#x7528;&#x60C5;&#x51B5;)&#xFF0C;&#x53EA;&#x9700;&#x6267;&#x884C;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">dnf -y <span class="token function">install</span> <span class="token function">htop</span>
</code></pre>
<p>&#x6267;&#x884C;&#x6B64;&#x547D;&#x4EE4;&#xFF0C;dnf &#x4F1A;&#x5728; Rocky Linux &#x5305;&#x5B58;&#x50A8;&#x5E93;&#x4E2D;&#x67E5;&#x627E;&#x5E76;&#x5B89;&#x88C5; htop&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x5B89;&#x88C5; htop &#x7684;&#x4F9D;&#x8D56;&#x5305;(&#x5982;&#x679C;&#x6709;&#x4F9D;&#x8D56;&#x7684;&#x8BDD;)&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x65E0;&#x9700;&#x62C5;&#x5FC3;&#x4F9D;&#x8D56;&#x9879;&#x3002;</p>
<p>&#x5982;&#x679C;&#x51FA;&#x73B0;&#x4E86; htop &#x7684;&#x65B0;&#x7248;&#x672C;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; upgrade &#x5B50;&#x547D;&#x4EE4;&#x5B89;&#x88C5;&#x66F4;&#x65B0;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">dnf upgrade <span class="token function">htop</span> -y
</code></pre>
<p>&#x8FD9;&#x6761;&#x547D;&#x4EE4;&#x4F1A;&#x5347;&#x7EA7; htop &#x53CA;&#x5176;&#x4F9D;&#x8D56;&#x5305;&#x5230;&#x6700;&#x65B0;&#x7684;&#x7248;&#x672C;&#x3002;</p>
<p>&#x5305;&#x7BA1;&#x7406;&#x5668;&#x8FD8;&#x652F;&#x6301;&#x5C06;&#x5305;&#x56DE;&#x6EDA;&#x5230;&#x4EE5;&#x524D;&#x7248;&#x672C;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">dnf downgrade <span class="token function">htop</span> -y
</code></pre>
<p>&#x5728;&#x66F4;&#x65B0;&#x7684;&#x7248;&#x672C;&#x5B58;&#x5728;&#x6F0F;&#x6D1E;&#x6216;&#x9519;&#x8BEF;&#x65F6;&#xFF0C;&#x56DE;&#x6EDA;&#x529F;&#x80FD;&#x5C31;&#x663E;&#x5F97;&#x5C24;&#x4E3A;&#x91CD;&#x8981;&#x4E86;&#x3002;</p>
<p>&#x5220;&#x9664;&#x5B89;&#x88C5;&#x7684;&#x5305;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">dnf remove <span class="token function">htop</span> -y
</code></pre>
<blockquote>
<p>&#x6CE8;&#x610F;&#xFF1A;</p>
<ol>
<li>Rocky Linux &#x662F; CentOS &#x9879;&#x76EE;&#x7684;&#x521B;&#x59CB;&#x4EBA; <strong>Gregory Kurtzer</strong> &#x9886;&#x5BFC;&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x7528;&#x4EE5;&#x66FF;&#x6362; CentOS&#x3002;&#x7EA2;&#x5E3D;&#x5BA3;&#x79F0; CentOS 8 &#x5C06;&#x5728;2021&#x5E74;&#x5E95;&#x505C;&#x6B62;&#x7EF4;&#x62A4;&#x3002;</li>
<li>&#x5728; CentOS 7 &#x53CA;&#x5176;&#x4E4B;&#x524D;&#x7684;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528; <strong>yum</strong> &#x4F5C;&#x4E3A;&#x5305;&#x7BA1;&#x7406;&#xFF0C;&#x5728; CentOS 8 &#x53CA; Rocky Linux 8 &#x4E2D;&#xFF0C;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x4E3A; <strong>dnf</strong>&#xFF0C;&#x4E24;&#x8005;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x76F8;&#x4F3C;&#x3002;</li>
<li>&#x5BF9;&#x5B66;&#x4E60; Rocky Linux &#x7CFB;&#x7EDF;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#xFF0C;&#x53EF;&#x4EE5;&#x9605;&#x8BFB;&#x6211;&#x7684;&#x300A;Rocky Linux&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x300B;&#x3002;</li>
</ol>
</blockquote>
<p>Helm &#x4F5C;&#x4E3A; Kubernetes &#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x7BA1;&#x7406;&#x5668;&#xFF0C;&#x4F5C;&#x7528;&#x4E0E; dnf &#x76F8;&#x4F3C;&#x3002;dnf &#x7528;&#x6765;&#x7BA1;&#x7406; Rocky Linux &#x4E0A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;Helm &#x7528;&#x6765;&#x7BA1;&#x7406; Kubernetes &#x4E0A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x6211;&#x5C06;&#x5728;&#x4E0B;&#x6587;&#x4E2D;&#x5BF9;&#x6B64;&#x8FDB;&#x884C;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x4ECB;&#x7ECD;&#x3002;</p>
<h3 id="kubernetes-&#x7684;&#x5305;&#x7BA1;&#x7406;&#x5668;">Kubernetes &#x7684;&#x5305;&#x7BA1;&#x7406;&#x5668;</h3>
<p>&#x867D;&#x7136; Helm &#x548C; dnf &#x540C;&#x4E3A;&#x5305;&#x7BA1;&#x7406;&#x5668;&#xFF0C;&#x4F46;&#x5B9E;&#x73B0;&#x7684;&#x7EC6;&#x8282;&#x8FD8;&#x662F;&#x6709;&#x4E9B;&#x5DEE;&#x5F02;&#x7684;&#x3002;dnf &#x64CD;&#x4F5C;&#x7684;&#x662F; RPM &#x5305;&#xFF0C;Helm &#x5904;&#x7406;&#x7684; Charts&#x3002;Helm &#x7684; Charts &#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F; Kubernetes &#x7684; RPM &#x5305;&#x3002;Charts &#x5305;&#x542B;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x6240;&#x9700;&#x7684;&#x58F0;&#x660E;&#x6027;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#xFF0C;&#x4E0E; RPM &#x7C7B;&#x4F3C;&#xFF0C;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4F9D;&#x8D56;&#x9879;&#x3002;</p>
<p>Helm &#x901A;&#x8FC7;&#x5B58;&#x50A8;&#x5E93;&#x83B7;&#x53D6; Charts&#x3002;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x5728;&#x521B;&#x5EFA;&#x5B8C;&#x6210;&#x58F0;&#x660E;&#x6027;&#x7684; YAML &#x6587;&#x4EF6;&#x540E;&#xFF0C;&#x6253;&#x5305;&#x4E3A; Charts&#xFF0C;&#x7136;&#x540E;&#x5C06; Charts &#x5305;&#x5B58;&#x653E;&#x5728;&#x5B58;&#x50A8;&#x5E93;&#x4E2D;&#xFF0C;&#x7528;&#x6237;&#x4F7F;&#x7528; Helm &#x641C;&#x7D22;&#x8981;&#x90E8;&#x7F72;&#x5230; Kubernetes &#x4E0A;&#x7684; Charts&#xFF0C;&#x8FD9;&#x7C7B;&#x4F3C;&#x7528;&#x6237;&#x4F7F;&#x7528; dnf &#x641C;&#x7D22;&#x8981;&#x90E8;&#x7F72;&#x5230; Rocky Linux &#x7684; RPM &#x8F6F;&#x4EF6;&#x5305;&#x3002;</p>
<p>&#x4EE5;&#x90E8;&#x7F72; Redis &#x4E3A;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5DF2;&#x53D1;&#x5E03;&#x5230;&#x5B58;&#x50A8;&#x5E93;&#x4E2D;&#x7684; Redis Chart&#xFF0C;&#x901A;&#x8FC7; Helm &#x5C06;&#x5176;&#x90E8;&#x7F72;&#x5230; Kubernetes &#x4E0A;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">helm <span class="token function">install</span> redis bitnami/redis --namespace<span class="token operator">=</span>redis
</code></pre>
<p>&#x8FD9;&#x6761;&#x547D;&#x4EE4;&#x628A; bitnami chart &#x4ED3;&#x5E93;&#x4E2D;&#x7684; redis chart &#x5B89;&#x88C5;&#x5230; Kubernetes &#x7684; redis &#x547D;&#x540D;&#x7A7A;&#x95F4;&#x4E2D;&#x3002;&#x8FD9;&#x662F;&#x521D;&#x59CB;&#x5B89;&#x88C5;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6709;&#x65B0;&#x7248;&#x7684; Redis Chart &#x53EF;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5982;&#x4E0B;&#x547D;&#x4EE4;&#x5347;&#x7EA7;&#x5230;&#x65B0;&#x7248;&#x672C;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">helm upgrade redis bitnami/redis --namespace<span class="token operator">=</span>redis
</code></pre>
<p>&#x5982;&#x679C;&#x53D1;&#x73B0;&#x65B0;&#x7248;&#x672C;&#x5B58;&#x5728; bug&#xFF0C;&#x7528;&#x6237;&#x4F1A;&#x6BD4;&#x8F83;&#x5173;&#x5FC3;&#x5982;&#x4F55;&#x56DE;&#x6EDA;&#xFF0C;Helm&#x63D0;&#x4F9B;&#x4E86; rollback &#x547D;&#x4EE4;&#x6765;&#x5904;&#x7406;&#x56DE;&#x6EDA;&#x64CD;&#x4F5C;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">helm rollback redis <span class="token number">1</span> --namespace<span class="token operator">=</span>redis
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x4F1A;&#x5C06; Redis &#x56DE;&#x6EDA;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x4E0D;&#x518D;&#x9700;&#x8981; Redis &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; uninstall &#x547D;&#x4EE4;&#x5220;&#x9664;&#xFF1A;</p>
<pre class="language-"><code class="lang-shell">helm uninstall redis --namespace<span class="token operator">=</span>redis
</code></pre>
<p>&#x4E86;&#x89E3;&#x4E86; Helm &#x4F5C;&#x4E3A;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x7684;&#x529F;&#x80FD;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x8BA8;&#x8BBA;&#x4E0B; Helm &#x7ED9; Kubernetes &#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#x3002;&#x5728;&#x4E0A;&#x4E00;&#x8282;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x521B;&#x5EFA; Kubernetes &#x8D44;&#x6E90;&#x65F6;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x73B0;&#x5728;&#x6765;&#x770B;&#x770B; Helm &#x662F;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x6311;&#x6218;&#x7684;&#x3002;</p>
<h4 id="kubernetes-&#x8D44;&#x6E90;&#x7684;&#x62BD;&#x8C61;&#x590D;&#x6742;&#x6027;">Kubernetes &#x8D44;&#x6E90;&#x7684;&#x62BD;&#x8C61;&#x590D;&#x6742;&#x6027;</h4>
<p>&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x63A5;&#x5230;&#x4E86;&#x5728; Kubernetes &#x4E0A;&#x90E8;&#x7F72; MySQL &#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x914D;&#x7F6E;&#x521B;&#x5EFA;&#x5BB9;&#x5668;&#x3001;&#x7F51;&#x7EDC;&#x3001;&#x5B58;&#x50A8;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x4ECE;&#x5934;&#x914D;&#x7F6E;&#x8FD9;&#x6837;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x6709;&#x5F88;&#x9AD8;&#x7684; Kubernetes &#x76F8;&#x5173;&#x6280;&#x672F;&#x8981;&#x6C42;&#xFF0C;&#x5BF9;&#x4E8E;&#x65B0;&#x624B;&#x6216;&#x8005;&#x7ECF;&#x9A8C;&#x4E0D;&#x4E30;&#x5BCC;&#x7684;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x5C0F;&#x7684;&#x6311;&#x6218;&#x3002;</p>
<p>&#x6709;&#x4E86; Helm&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE; Charts &#x5E93;&#x4E2D;&#x641C;&#x7D22; MySQL Charts&#x3002;&#x8FD9;&#x4E9B; Charts &#x7531;&#x793E;&#x533A;&#x4E2D;&#x7684; Charts &#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7F16;&#x5199;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x90E8;&#x7F72; MySQL &#x6240;&#x9700;&#x7684;&#x58F0;&#x660E;&#x6027;&#x914D;&#x7F6E;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4F7F;&#x7528; Helm &#x5B89;&#x88C5;MySQL&#xFF0C;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;</p>
<h4 id="&#x5386;&#x53F2;&#x7248;&#x672C;">&#x5386;&#x53F2;&#x7248;&#x672C;</h4>
<p>Helm &#x6709;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x53EB;&#x505A;&#x53D1;&#x5E03;&#x5386;&#x53F2;&#x3002;&#x5F53;&#x7B2C;&#x4E00;&#x6B21;&#x5B89;&#x88C5; Helm chart &#x65F6;&#xFF0C;Helm &#x4F1A;&#x8BB0;&#x5F55;&#x4E00;&#x4E2A;&#x521D;&#x59CB;&#x7248;&#x672C;&#x3002;&#x968F;&#x7740;&#x7248;&#x672C;&#x66F4;&#x65B0;&#xFF0C;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x4E5F;&#x968F;&#x7740;&#x4FEE;&#x6539;&#xFF0C;&#x4ECE;&#x800C;&#x4FDD;&#x5B58;&#x4E86;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;&#x5FEB;&#x7167;&#x3002;
&#x4E0B;&#x56FE;&#x662F;&#x7248;&#x672C;&#x66F4;&#x65B0;&#x7684;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#xFF0C;&#x84DD;&#x8272;&#x65B9;&#x5757;&#x8868;&#x793A;&#x66F4;&#x65B0;&#x7684;&#x7248;&#x672C;&#xFF1A;</p>
<figure id="fig2.1.4"><img src="https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/1.6-Upgrade.jpg" alt="1.6-Upgrade" style="zoom:80%;"><figcaption>1.6-Upgrade</figcaption></figure>
<p>&#x56FE;1.6 - &#x7248;&#x672C;&#x5386;&#x53F2;</p>
<p>&#x8BB0;&#x5F55;&#x6BCF;&#x6B21;&#x7248;&#x672C;&#x66F4;&#x65B0;&#x4FBF;&#x4E8E;&#x56DE;&#x6EDA;&#x64CD;&#x4F5C;&#x3002;Helm &#x4E2D;&#x7684;&#x7248;&#x672C;&#x56DE;&#x6EDA;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x7528;&#x6237;&#x53EA;&#x9700;&#x6307;&#x5411;&#x5148;&#x524D;&#x7684;&#x7248;&#x672C;&#xFF0C;Helm &#x5C31;&#x4F1A;&#x5C06;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x6062;&#x590D;&#x5230;&#x6240;&#x9009;&#x7248;&#x672C;&#x3002;&#x6709;&#x4E86; Helm&#xFF0C;n-1 &#x5907;&#x4EFD;&#x7684;&#x65E5;&#x5B50;&#x5DF2;&#x7ECF;&#x4E00;&#x53BB;&#x4E0D;&#x590D;&#x8FD4;&#x4E86;&#x3002;Helm &#x53EF;&#x4EE5;&#x56DE;&#x6EDA;&#x5230;&#x4EFB;&#x610F;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x56DE;&#x6EDA;&#x5230;&#x5E94;&#x7528;&#x7B2C;&#x4E00;&#x6B21;&#x90E8;&#x7F72;&#x65F6;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<h4 id="&#x914D;&#x7F6E;&#x52A8;&#x6001;&#x58F0;&#x660E;&#x5F0F;&#x8D44;&#x6E90;">&#x914D;&#x7F6E;&#x52A8;&#x6001;&#x58F0;&#x660E;&#x5F0F;&#x8D44;&#x6E90;</h4>
<p>Kubernetes &#x7684;&#x58F0;&#x660E;&#x5F0F;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x662F;&#x9759;&#x6001;&#x7684;&#xFF0C;&#x65E0;&#x6CD5;&#x53C2;&#x6570;&#x5316;&#xFF0C;&#x54EA;&#x6015;&#x76F8;&#x4F3C;&#x5EA6;&#x5F88;&#x9AD8;&#x7684;&#x4E24;&#x4E2A;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#xFF0C;&#x90FD;&#x5F97;&#x72EC;&#x7ACB;&#x914D;&#x7F6E;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x91CF;&#x548C;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#x3002;Helm &#x5F15;&#x5165;&#x4E86; values &#x548C; template &#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>values &#x662F; Helm Charts &#x7684;&#x53C2;&#x6570;&#xFF0C;template &#x662F;&#x57FA;&#x4E8E; values &#x52A8;&#x6001;&#x751F;&#x6210;&#x7684;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#xFF0C;&#x6709;&#x4E86;&#x5B83;&#x4EEC;&#xFF0C;Helm &#x7BA1;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C31;&#x7075;&#x6D3B;&#x591A;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x66F4;&#x6613;&#x4E8E;&#x7EF4;&#x62A4;&#x3002;</p>
<p>values &#x548C; template &#x5141;&#x8BB8;&#x7528;&#x6237;&#x6267;&#x884C;&#x4EE5;&#x4E0B;&#x64CD;&#x4F5C;&#xFF1A;</p>
<ul>
<li>&#x53C2;&#x6570;&#x5316;&#x516C;&#x5171;&#x5B57;&#x6BB5;&#xFF0C;&#x4F8B;&#x5982; Deployment &#x4E2D;&#x7684;&#x955C;&#x50CF;&#x540D;&#x79F0;&#x548C; Service &#x4E2D;&#x7684;&#x7AEF;&#x53E3;</li>
<li>&#x6839;&#x636E;&#x7528;&#x6237;&#x8F93;&#x5165;&#x751F;&#x6210;&#x8F83;&#x957F;&#x7684; YAML &#x914D;&#x7F6E;&#x7247;&#x6BB5;&#xFF0C;&#x4F8B;&#x5982; Deployment &#x4E2D;&#x7684;&#x5377;&#x6302;&#x8F7D;&#x6216; ConfigMap &#x4E2D;&#x7684;&#x6570;&#x636E;</li>
<li>&#x5305;&#x542B;&#x6216;&#x6392;&#x9664;&#x8D44;&#x6E90;</li>
</ul>
<p>&#x52A8;&#x6001;&#x751F;&#x6210;&#x58F0;&#x660E;&#x5F0F;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x4F7F;&#x521B;&#x5EFA;&#x57FA;&#x4E8E; YAML &#x683C;&#x5F0F;&#x7684;&#x8D44;&#x6E90;&#x53D8;&#x5F97;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x53C8;&#x5BB9;&#x6613;&#x590D;&#x5236;&#x3002;</p>
<h4 id="&#x672C;&#x5730;&#x72B6;&#x6001;&#x548C;&#x8FD0;&#x884C;&#x65F6;&#x4E00;&#x81F4;&#x6027;">&#x672C;&#x5730;&#x72B6;&#x6001;&#x548C;&#x8FD0;&#x884C;&#x65F6;&#x4E00;&#x81F4;&#x6027;</h4>
<p>&#x5305;&#x7BA1;&#x7406;&#x5668;&#x6709;&#x6548;&#x907F;&#x514D;&#x4E86;&#x7528;&#x6237;&#x624B;&#x52A8;&#x4FEE;&#x6539;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53CA;&#x4F9D;&#x8D56;&#xFF0C;&#x6240;&#x6709;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5305;&#x53CA;&#x4F9D;&#x8D56;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x5B8C;&#x6210;&#x3002;&#x8FD9;&#x4E2A;&#x4F18;&#x52BF;&#x540C;&#x6837;&#x9002;&#x7528;&#x4E8E; Helm&#xFF0C;&#x56E0;&#x4E3A; Helm charts &#x5305;&#x542B;&#x4E86; Kubernetes &#x8D44;&#x6E90;&#x7684;&#x5404;&#x79CD;&#x914D;&#x7F6E;&#xFF0C;&#x6240;&#x4EE5;&#x7528;&#x6237;&#x65E0;&#x9700;&#x76F4;&#x63A5;&#x4FEE;&#x6539; Kubernetes &#x7684;&#x8D44;&#x6E90;&#x3002;&#x5982;&#x679C;&#x7528;&#x6237;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5411; Helm charts &#x63D0;&#x4F9B;&#x65B0;&#x7684; values&#xFF0C;&#x5E76;&#x5BF9;&#x7248;&#x672C;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x8FD9;&#x6709;&#x6548;&#x4FDD;&#x8BC1;&#x4E86;&#x672C;&#x5730;&#x72B6;&#x6001;&#x548C;&#x8FD0;&#x884C;&#x65F6;&#x72B6;&#x6001;&#x5728;&#x4FEE;&#x6539;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<h4 id="&#x667A;&#x80FD;&#x90E8;&#x7F72;">&#x667A;&#x80FD;&#x90E8;&#x7F72;</h4>
<p>Helm &#x80FD;&#x591F;&#x8BC6;&#x522B;&#x8981;&#x521B;&#x5EFA;&#x7684; Kubernetes &#x8D44;&#x6E90;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#xFF0C;&#x7B80;&#x5316;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x8FC7;&#x7A0B;&#x3002;Helm &#x5206;&#x6790; Charts &#x5305;&#x542B;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x8D44;&#x6E90;&#x7C7B;&#x578B;&#x6392;&#x5E8F;&#xFF0C;&#x907F;&#x514D;&#x56E0;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x800C;&#x5BFC;&#x81F4;&#x8D44;&#x6E90;&#x90E8;&#x7F72;&#x5931;&#x8D25;&#x3002;&#x4F8B;&#x5982; Secret &#x548C; Configmap &#x5E94;&#x5728; Deployment  &#x4E4B;&#x524D;&#x521B;&#x5EFA;&#xFF0C;&#x56E0;&#x4E3A; Deployment &#x53EF;&#x80FD;&#x4F1A;&#x4EE5;&#x5377;&#x7684;&#x5F62;&#x5F0F;&#x6302;&#x8F7D;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x3002;Helm &#x65E0;&#x9700;&#x7528;&#x6237;&#x5E72;&#x9884;&#x5C31;&#x80FD;&#x6309;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x521B;&#x5EFA;&#x5B83;&#x4EEC;&#xFF0C;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x6027;&#x88AB;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#xFF0C;&#x7528;&#x6237;&#x65E0;&#x9700;&#x5173;&#x5FC3;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x7684;&#x521B;&#x5EFA;&#x987A;&#x5E8F;&#x3002;</p>
<h4 id="&#x751F;&#x547D;&#x5468;&#x671F;-hooks-&#x7BA1;&#x7406;">&#x751F;&#x547D;&#x5468;&#x671F; hooks &#x7BA1;&#x7406;</h4>
<p>&#x4E0E;&#x5176;&#x4ED6;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x7C7B;&#x4F3C;&#xFF0C;Helm &#x63D0;&#x4F9B;&#x4E86;&#x5B9A;&#x4E49;&#x751F;&#x547D;&#x5468;&#x671F;&#x94A9;&#x5B50;(hooks)&#x7684;&#x80FD;&#x529B;&#x3002;&#x751F;&#x547D;&#x5468;&#x671F;&#x94A9;&#x5B50;&#x53EF;&#x4EE5;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x4E0D;&#x540C;&#x9636;&#x6BB5;&#x81EA;&#x52A8;&#x89E6;&#x53D1;&#x4E8B;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x505A;&#x4EE5;&#x4E0B;&#x4E8B;&#x60C5;&#xFF1A;</p>
<ul>
<li>&#x5347;&#x7EA7;&#x65F6;&#x6267;&#x884C;&#x5907;&#x4EFD;</li>
<li>&#x56DE;&#x6EDA;&#x65F6;&#x6062;&#x590D;&#x6570;&#x636E;</li>
<li>&#x5728;&#x5B89;&#x88C5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x524D;&#x9A8C;&#x8BC1; Kubernetes &#x73AF;&#x5883;</li>
</ul>
<p>&#x751F;&#x547D;&#x5468;&#x671F;&#x94A9;&#x5B50;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5C06;&#x4EFB;&#x52A1;&#x7684;&#x590D;&#x6742;&#x6027;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x53EF;&#x80FD;&#x4E0D;&#x662F; kubernetes &#x7279;&#x6709;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Kubernetes &#x7528;&#x6237;&#x53EF;&#x80FD;&#x4E0D;&#x719F;&#x6089;&#x6570;&#x636E;&#x5E93;&#x5907;&#x4EFD;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x6E05;&#x695A;&#x4F55;&#x65F6;&#x8BE5;&#x6267;&#x884C;&#x8FD9;&#x6837;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x751F;&#x547D;&#x5468;&#x671F;&#x94A9;&#x5B50;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x4E13;&#x4E1A;&#x4EBA;&#x5458;&#x7F16;&#x5199;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x6837;&#x7528;&#x6237;&#x5C31;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x9AD8;&#x6548;&#x5730;&#x4E13;&#x6CE8;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x5176;&#x4ED6;&#x7EC6;&#x8282;&#x3002;</p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> By <a href="https://github.com/weiwendi" target="_blank">&#x9B4F;&#x6587;&#x5F1F;</a>&#xFF0C;&#x4F7F;&#x7528;<a href="https://creativecommons.org/licenses/by-sa/4.0/" target="_blank">&#x77E5;&#x8BC6;&#x5171;&#x4EAB; &#x7F72;&#x540D;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5171;&#x4EAB; 4.0 &#x56FD;&#x9645;&#x534F;&#x8BAE;</a>&#x53D1;&#x5E03; </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> <i>updated</i> 2021-08-10 18:21:46 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../cloudnative/jieshao.html" class="navigation navigation-prev " aria-label="Previous page: 课程介绍">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="bushu.html" class="navigation navigation-next " aria-label="Next page: Helm 部署">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Kubernetes and Helm 介绍","level":"2.1","depth":1,"next":{"title":"Helm 部署","level":"2.2","depth":1,"path":"helm/bushu.md","ref":"helm/bushu.md","articles":[]},"previous":{"title":"课程介绍","level":"1.2","depth":1,"path":"cloudnative/jieshao.md","ref":"cloudnative/jieshao.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-highlight","-lunr","-search","prism","prism-themes","github","donate","codesnippet","ga","adsense","github-buttons@2.1.0","splitter","simple-page-toc","page-toc-button","image-captions","back-to-top-button","search-plus","sharing-plus","favicon","theme-default","page-footer-ex","search-pro","code","auto-scroll-table","advanced-emoji","flexible-alerts","editlink"],"ignores":["_book","node_modules"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"prism":{"css":["prism-themes/themes/prism-base16-ateliersulphurpool.light.css"],"lang":{"shell":"bash"}},"github":{"url":"https://github.com/weiwendi/cloudnative-handbook"},"editlink":{"label":"编辑本页","multilingual":false,"base":"https://github.com/weiwendi/cloudnative-handbook/tree/main"},"simple-page-toc":{"maxDepth":3,"skipFirstH1":true},"page-footer-ex":{"copyright":"By [魏文弟](https://github.com/weiwendi)，使用[知识共享 署名-相同方式共享 4.0 国际协议](https://creativecommons.org/licenses/by-sa/4.0/)发布","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"<i>updated</i>"},"splitter":{},"search-pro":{},"adsense":{"client":"pub-8736620102237076","slot":"","format":"auto","element":".page-inner section","position":"bottom"},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"auto-scroll-table":{},"code":{"copyButtons":true},"donate":{"alipay":"https://gitee.com/sretech/images/raw/master/pays/alipay.jpg","alipayText":"支付宝","button":"请杯咖啡","title":"","wechat":"https://gitee.com/sretech/images/raw/master/pays/wechatpay.jpg","wechatText":"微信"},"codesnippet":{},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"https://gitee.com/sretech/images/raw/master/favicon/favicon.ico","bookmark":"https://gitee.com/sretech/images/raw/master/favicon/favicon.ico"},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"user":"weiwendi","repo":"cloudnative-handbook","types":["star"],"size":"small"},"flexible-alerts":{"danger":{"className":"danger","icon":"fa fa-ban","label":"Attention"},"note":{"className":"info","icon":"fa fa-info-circle","label":"Note"},"style":"callout","tip":{"className":"tip","icon":"fa fa-lightbulb-o","label":"Tip"},"warning":{"className":"warning","icon":"fa fa-exclamation-triangle","label":"Warning"},"comment":{"label":"Comment","icon":"fa fa-comments","className":"info"}},"ga":{"configuration":"auto","token":"UA-174057096-1"},"advanced-emoji":{"embedEmojis":false},"sharing":{"qq":true,"all":["douban","facebook","google","linkedin","twitter","weibo","messenger","qq","qzone"],"facebook":false,"weibo":false,"instapaper":false,"twitter":false,"vk":false,"google":false,"qzone":true},"theme-default":{"showLevel":true,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"search-plus":{},"image-captions":{"caption":"_CAPTION_","variable_name":"_pictures"}},"theme":"default","author":"魏文弟","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"_pictures":[{"backlink":"helm/jieshao.html#fig2.1.1","level":"2.1","list_caption":"Figure: 1.2dtcreate","alt":"1.2dtcreate","nro":1,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/1.2dtcreate.jpg","index":1,"caption_template":"_CAPTION_","label":"1.2dtcreate","attributes":{},"skip":false,"key":"2.1.1"},{"backlink":"helm/jieshao.html#fig2.1.2","level":"2.1","list_caption":"Figure: 1.3Service","alt":"1.3Service","nro":2,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/1.3Service.jpg","index":2,"caption_template":"_CAPTION_","label":"1.3Service","attributes":{},"skip":false,"key":"2.1.2"},{"backlink":"helm/jieshao.html#fig2.1.3","level":"2.1","list_caption":"Figure: 1.4-storageclass","alt":"1.4-storageclass","nro":3,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/1.4-storageclass.jpg","index":3,"caption_template":"_CAPTION_","label":"1.4-storageclass","attributes":{},"skip":false,"key":"2.1.3"},{"backlink":"helm/jieshao.html#fig2.1.4","level":"2.1","list_caption":"Figure: 1.6-Upgrade","alt":"1.6-Upgrade","nro":4,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/1.6-Upgrade.jpg","index":4,"caption_template":"_CAPTION_","label":"1.6-Upgrade","attributes":{},"skip":false,"key":"2.1.4"},{"backlink":"helm/bushu.html#fig2.2.1","level":"2.2","list_caption":"Figure: 2.1versions","alt":"2.1versions","nro":5,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/2.1versions.png","index":1,"caption_template":"_CAPTION_","label":"2.1versions","attributes":{},"skip":false,"key":"2.2.1"},{"backlink":"helm/bushu.html#fig2.2.2","level":"2.2","list_caption":"Figure: 2.2minikubeDrivers","alt":"2.2minikubeDrivers","nro":6,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/2.2minikubeDrivers.jpg","index":2,"caption_template":"_CAPTION_","label":"2.2minikubeDrivers","attributes":{},"skip":false,"key":"2.2.2"},{"backlink":"helm/anzhuangcharts.html#fig2.3.1","level":"2.3","list_caption":"Figure: 3.1 helm search hub wordpress outputs","alt":"3.1 helm search hub wordpress outputs","nro":7,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/3.1hubouts.jpg","index":1,"caption_template":"_CAPTION_","label":"3.1 helm search hub wordpress outputs","attributes":{},"skip":false,"key":"2.3.1"},{"backlink":"helm/anzhuangcharts.html#fig2.3.2","level":"2.3","list_caption":"Figure: 3.2 helm search hub wordpress yaml outputs","alt":"3.2 helm search hub wordpress yaml outputs","nro":8,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/3.2hubyamloutps.png","index":2,"caption_template":"_CAPTION_","label":"3.2 helm search hub wordpress yaml outputs","attributes":{},"skip":false,"key":"2.3.2"},{"backlink":"helm/anzhuangcharts.html#fig2.3.3","level":"2.3","list_caption":"Figure: 3.3 wordpress page details","alt":"3.3 wordpress page details","nro":9,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/3.3wordpressdetails.jpg","index":3,"caption_template":"_CAPTION_","label":"3.3 wordpress page details","attributes":{},"skip":false,"key":"2.3.3"},{"backlink":"helm/anzhuangcharts.html#fig2.3.4","level":"2.3","list_caption":"Figure: 3.4 bitnami wordpress","alt":"3.4 bitnami wordpress","nro":10,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/3.4bitnamiwordpress.jpg","index":4,"caption_template":"_CAPTION_","label":"3.4 bitnami wordpress","attributes":{},"skip":false,"key":"2.3.4"},{"backlink":"helm/anzhuangcharts.html#fig2.3.5","level":"2.3","list_caption":"Figure: 3.5 show chart","alt":"3.5 show chart","nro":11,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/3.5showchart.jpg","index":5,"caption_template":"_CAPTION_","label":"3.5 show chart","attributes":{},"skip":false,"key":"2.3.5"},{"backlink":"helm/anzhuangcharts.html#fig2.3.6","level":"2.3","list_caption":"Figure: 3.6 wordpress 首页","alt":"3.6 wordpress 首页","nro":12,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/3.8wordpresspage.jpg","index":6,"caption_template":"_CAPTION_","label":"3.6 wordpress 首页","attributes":{},"skip":false,"key":"2.3.6"},{"backlink":"helm/anzhuangcharts.html#fig2.3.7","level":"2.3","list_caption":"Figure: 3.7 admin pages","alt":"3.7 admin pages","nro":13,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/3.9adminpage.jpg","index":7,"caption_template":"_CAPTION_","label":"3.7 admin pages","attributes":{},"skip":false,"key":"2.3.7"},{"backlink":"helm/anzhuangcharts.html#fig2.3.8","level":"2.3","list_caption":"Figure: 3.8 dashboard","alt":"3.8 dashboard","nro":14,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/3.10adminpage2.png","index":8,"caption_template":"_CAPTION_","label":"3.8 dashboard","attributes":{},"skip":false,"key":"2.3.8"},{"backlink":"helm/kaifacharts.html#fig2.5.1","level":"2.5","list_caption":"Figure: 5.1 player stats page","alt":"5.1 player stats page","nro":15,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/5.1player-stats.jpg","index":1,"caption_template":"_CAPTION_","label":"5.1 player stats page","attributes":{},"skip":false,"key":"2.5.1"},{"backlink":"helm/helmcicd.html#fig2.7.1","level":"2.7","list_caption":"Figure: 7.1 fork","alt":"7.1 fork","nro":16,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/7.1fork.png","index":1,"caption_template":"_CAPTION_","label":"7.1 fork","attributes":{},"skip":false,"key":"2.7.1"},{"backlink":"helm/helmcicd.html#fig2.7.2","level":"2.7","list_caption":"Figure: 7.2 delete tar and index file","alt":"7.2 delete tar and index file","nro":17,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/7.2delete.jpg","index":2,"caption_template":"_CAPTION_","label":"7.2 delete tar and index file","attributes":{},"skip":false,"key":"2.7.2"},{"backlink":"helm/helmcicd.html#fig2.7.3","level":"2.7","list_caption":"Figure: 7.3 create github token.","alt":"7.3 create github token.","nro":18,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/7.3%20create%20github%20token.jpg","index":3,"caption_template":"_CAPTION_","label":"7.3 create github token.","attributes":{},"skip":false,"key":"2.7.3"},{"backlink":"helm/helmcicd.html#fig2.7.4","level":"2.7","list_caption":"Figure: 7.4 create jenkins github credentials","alt":"7.4 create jenkins github credentials","nro":19,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/7.4%20create%20github%20credentials.jpg","index":4,"caption_template":"_CAPTION_","label":"7.4 create jenkins github credentials","attributes":{},"skip":false,"key":"2.7.4"},{"backlink":"helm/helmcicd.html#fig2.7.5","level":"2.7","list_caption":"Figure: 7.5 create jenkins kubeconfig credentials","alt":"7.5 create jenkins kubeconfig credentials","nro":20,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/7.5%20create%20kubernetes%20credentials.jpg","index":5,"caption_template":"_CAPTION_","label":"7.5 create jenkins kubeconfig credentials","attributes":{},"skip":false,"key":"2.7.5"},{"backlink":"helm/helmcicd.html#fig2.7.6","level":"2.7","list_caption":"Figure: 7.6 add repo","alt":"7.6 add repo","nro":21,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/7.6%20add%20https%20github%20repository.png","index":6,"caption_template":"_CAPTION_","label":"7.6 add repo","attributes":{},"skip":false,"key":"2.7.6"},{"backlink":"helm/helmcicd.html#fig2.7.7","level":"2.7","list_caption":"Figure: 7.8 scan repo","alt":"7.8 scan repo","nro":22,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/7.8%20scan%20repository%20build.jpg","index":7,"caption_template":"_CAPTION_","label":"7.8 scan repo","attributes":{},"skip":false,"key":"2.7.7"},{"backlink":"helm/helmcicd.html#fig2.7.8","level":"2.7","list_caption":"Figure: 7.9 charts repo list","alt":"7.9 charts repo list","nro":23,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/7.9%20charts%20repo%20list.jpg","index":8,"caption_template":"_CAPTION_","label":"7.9 charts repo list","attributes":{},"skip":false,"key":"2.7.8"},{"backlink":"helm/helmcicd.html#fig2.7.9","level":"2.7","list_caption":"Figure: 7.10 stable list","alt":"7.10 stable list","nro":24,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/7.10%20stable%20list.jpg","index":9,"caption_template":"_CAPTION_","label":"7.10 stable list","attributes":{},"skip":false,"key":"2.7.9"},{"backlink":"helm/helmcicd.html#fig2.7.10","level":"2.7","list_caption":"Figure: 7.11 Proceed or Abort","alt":"7.11 Proceed or Abort","nro":25,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/Figure_7.17.jpg","index":10,"caption_template":"_CAPTION_","label":"7.11 Proceed or Abort","attributes":{},"skip":false,"key":"2.7.10"},{"backlink":"helm/operator.html#fig2.8.1","level":"2.8","list_caption":"Figure: 8.1 cr install helm chart","alt":"8.1 cr install helm chart","nro":26,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/8.1%20cr%20install%20chart.jpg","index":1,"caption_template":"_CAPTION_","label":"8.1 cr install helm chart","attributes":{},"skip":false,"key":"2.8.1"},{"backlink":"helm/operator.html#fig2.8.2","level":"2.8","list_caption":"Figure: 8.2 create quay image repo","alt":"8.2 create quay image repo","nro":27,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/8.2%20create%20quay%20image%20repo.jpg","index":2,"caption_template":"_CAPTION_","label":"8.2 create quay image repo","attributes":{},"skip":false,"key":"2.8.2"},{"backlink":"helm/operator.html#fig2.8.3","level":"2.8","list_caption":"Figure: 8.3 create public image repository","alt":"8.3 create public image repository","nro":28,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/8.3%20create%20public%20image%20repository.jpg","index":3,"caption_template":"_CAPTION_","label":"8.3 create public image repository","attributes":{},"skip":false,"key":"2.8.3"},{"backlink":"helm/operator.html#fig2.8.4","level":"2.8","list_caption":"Figure: 8.4 player stats operator image","alt":"8.4 player stats operator image","nro":29,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/8.4%20player%20stats%20operator%20image.jpg","index":4,"caption_template":"_CAPTION_","label":"8.4 player stats operator image","attributes":{},"skip":false,"key":"2.8.4"},{"backlink":"helm/security.html#fig2.10.1","level":"2.10","list_caption":"Figure: 9.1 gpg outputs","alt":"9.1 gpg outputs","nro":30,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/9.1%20gpg%20infors.jpg","index":1,"caption_template":"_CAPTION_","label":"9.1 gpg outputs","attributes":{},"skip":false,"key":"2.10.1"},{"backlink":"helm/security.html#fig2.10.2","level":"2.10","list_caption":"Figure: 9.2 helm versions","alt":"9.2 helm versions","nro":31,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/9.2%20helm%20release%20download.jpg","index":2,"caption_template":"_CAPTION_","label":"9.2 helm versions","attributes":{},"skip":false,"key":"2.10.2"},{"backlink":"helm/security.html#fig2.10.3","level":"2.10","list_caption":"Figure: 9.3 digital signature","alt":"9.3 digital signature","nro":32,"url":"https://gitee.com/sretech/images/raw/master/cloudnative-handbook/helm/9.3%20digital%20signature.jpg","index":3,"caption_template":"_CAPTION_","label":"9.3 digital signature","attributes":{},"skip":false,"key":"2.10.3"}]},"title":"云原生运维指南","language":"zh-hans","links":{"sidebar":{"博客":"https://www.aiops.red","公众号: sretech":"https://gitee.com/sretech/images/raw/master/wechatpublic.jpg"}},"gitbook":"*","description":"从理论到实践系统介绍云原生环境下的运维"},"file":{"path":"helm/jieshao.md","mtime":"2021-08-10T10:21:46.801Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-09-01T09:21:34.056Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-adsense/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-auto-scroll-table/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-flexible-alerts/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

